-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \log\02_Variablen_Review_Indexbildung.log
  log type:  text
 opened on:  25 May 2022, 15:36:30

. 
. 
. //------------ VARIABLEN REVIEW + INDEXBILDUNG -----------
. 
. 
. //----------- sexuelle Orientierung -----------
. replace sexorient = .m if sexorient == 6                                        //6 - lehne Kategorisierung ab - als Missing umcodiert
(0 real changes made)

. gen sexorient_het = sexorient

. replace sexorient_het = .z if sexorient_het > 3 & sexorient_het != .m & sexorient != .n                         //entfernt homosexuelle Orientierung
(0 real changes made)

. recode sexorient_het (1=3) (2=2) (3=1)                  //label         //Umskalieren der Orientierungsskala für heterosexuelle auf 3er Skala  
(sexorient_het: 747 changes made)

. label define sexorient_het 3 "ausschließich heterosexuell" 2 "vorwiegend heterosexuell" 1 "bisexuell"

. label values sexorient_het sexorient_het                                

. tab sexorient_het, missing                                                                                                                      

              sexorient_het |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
                  bisexuell |        102        7.85        7.85
   vorwiegend heterosexuell |        552       42.49       50.35
ausschließich heterosexuell |        645       49.65      100.00
----------------------------+-----------------------------------
                      Total |      1,299      100.00

. 
.                                                                                                         
. //----------- Einkommen -----------
. replace hhincome = .m if hhincome == 11                                         //11 - keine Angabe - als Missing umcodiert
(194 real changes made, 194 to missing)

. tab hhincome, missing

                       Einkommen |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
Weniger als 10.000 Euro pro Jahr |        289       22.25       22.25
   10.000 - 20.000 Euro pro Jahr |        204       15.70       37.95
   20.000 - 30.000 Euro pro Jahr |        162       12.47       50.42
   30.000 - 40.000 Euro pro Jahr |        133       10.24       60.66
   40.000 - 50.000 Euro pro Jahr |        108        8.31       68.98
   50.000 - 60.000 Euro pro Jahr |         69        5.31       74.29
   60.000 - 70.000 Euro pro Jahr |         61        4.70       78.98
   70.000 - 80.000 Euro pro Jahr |         29        2.23       81.22
   80.000 - 90.000 Euro pro Jahr |         20        1.54       82.76
   Mehr als 90.000 Euro pro Jahr |         30        2.31       85.07
                              .m |        194       14.93      100.00
---------------------------------+-----------------------------------
                           Total |      1,299      100.00

. 
. 
. //----------- Haushalt Größe -----------
. replace hhsize_a = .m if hhsize_a == 75                                         //macht Angabe "75 Erwachsene in einem Haushalt" zumissing                                                                 
>                                                                              
(1 real change made, 1 to missing)

. egen hhsize = rowtotal (hhsize_a hhsize_c)                                      //rowtotal behandelt missings wie 0 (dadurch werden vorherige 0-missings wieder vergeben)

. replace hhsize = .m if hhsize == 0                                                      //0-missings wieder zu echten missings machen
(18 real changes made, 18 to missing)

. order hhsize, before (hhsize_a)

. tab hhsize, missing     

     hhsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        263       20.25       20.25
          2 |        529       40.72       60.97
          3 |        257       19.78       80.75
          4 |        153       11.78       92.53
          5 |         50        3.85       96.38
          6 |         15        1.15       97.54
          7 |          5        0.38       97.92
          8 |          2        0.15       98.08
          9 |          3        0.23       98.31
         10 |          1        0.08       98.38
         11 |          2        0.15       98.54
         18 |          1        0.08       98.61
         .m |         18        1.39      100.00
------------+-----------------------------------
      Total |      1,299      100.00

. 
. 
. //----------- Fantasien -----------
. egen sexfan = rowmean (sexfan01 sexfan02)

. replace sexfan = .m if sexfan01 == .m & sexfan02 == .m
(0 real changes made)

. replace sexfan = .n if sexfan == .      
(0 real changes made)

. tab sexfan, missing

     sexfan |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         36        2.77        2.77
        1.5 |         27        2.08        4.85
          2 |         98        7.54       12.39
        2.5 |        114        8.78       21.17
          3 |        116        8.93       30.10
        3.5 |        127        9.78       39.88
          4 |        156       12.01       51.89
        4.5 |        134       10.32       62.20
          5 |        176       13.55       75.75
        5.5 |        112        8.62       84.37
          6 |         91        7.01       91.38
        6.5 |         56        4.31       95.69
          7 |         56        4.31      100.00
------------+-----------------------------------
      Total |      1,299      100.00

. 
. 
. //----------- sexuell aktiv seit wann (Alter) -----------
. replace sexact_time = .m if sexact_time < 10                            //entfernt Fälle, in denen Alter für erster Sex <10 oder Alter < als Alter für erster Sex
(10 real changes made, 10 to missing)

. replace sexact_time = .m if sexact_time > age & sexact_time != .n
(0 real changes made)

.                                                                                                                                                                                         
.         
. //----------- Häufigkeit Sex -----------
. replace sexquan01 = 0 if sexquan01 == .m                //number        //0-Angaben, die vorher zu Missings gemacht wurden
(23 real changes made)

. replace sexquan01 = .m if sexquan01 > 40                                        //entfernt alle Angaben, die mehr als 40 mal Sex im Monat haben
(11 real changes made, 11 to missing)

. 
. gen sexquan = .                                                                                         //Häufigkeit kategorisieren
(1,299 missing values generated)

. replace sexquan = 1 if sexquan01 == 0                                           //nie, ein paar Mal im Jahr, ein paar Mal im Monat, 2 bis 3 pro Woche, 4 oder mehr pro Woche
(23 real changes made)

. replace sexquan = 2 if sexquan01 > 0    
(1,276 real changes made)

. replace sexquan = 3 if sexquan01 > 3
(1,059 real changes made)

. replace sexquan = 4 if sexquan01 > 9
(600 real changes made)

. replace sexquan = 5 if sexquan01 > 17
(196 real changes made)

. 
. 
. //----------- Praktiken -----------
. egen sexactBcount = anycount (sexactB01-sexactB05), values(4 5 6 7)     //Index für "grundlegende Sex Praktiken finden statt"

. replace sexactBcount = .m if sexactB01 - sexactB05 == .m
(0 real changes made)

. replace sexactBcount = .n if sexactBcount == .
(0 real changes made)

. tab sexactBcount, missing

  sexactB01 |
  sexactB02 |
  sexactB03 |
  sexactB04 |
  sexactB05 |
 == 4 5 6 7 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8        0.62        0.62
          1 |         34        2.62        3.23
          2 |         64        4.93        8.16
          3 |        235       18.09       26.25
          4 |        319       24.56       50.81
          5 |        639       49.19      100.00
------------+-----------------------------------
      Total |      1,299      100.00

. 
. gen sexactSuccess01 = 0                                                                                 //Praktiken operationalisieren - Praktiken, die man mag

. gen sexactSuccess02 = 0

. gen sexactSuccess03 = 0

. gen sexactSuccess04 = 0

. gen sexactSuccess05 = 0

. gen sexactSuccess06 = 0

. gen sexactSuccess07 = 0

. 
. replace sexactSuccess01 = 1 if sexactB01 > 3 & sexactA01 > 4    //Praktik ist regelmäßig Bestandteil und wird gemocht
(890 real changes made)

. replace sexactSuccess02 = 1 if sexactB02 > 3 & sexactA02 > 4
(796 real changes made)

. replace sexactSuccess03 = 1 if sexactB03 > 3 & sexactA03 > 4
(915 real changes made)

. replace sexactSuccess04 = 1 if sexactB04 > 3 & sexactA04 > 4
(953 real changes made)

. replace sexactSuccess05 = 1 if sexactB05 > 3 & sexactA05 > 4
(1,227 real changes made)

. replace sexactSuccess06 = 1 if sexactB06 > 3 & sexactA06 > 4
(62 real changes made)

. replace sexactSuccess07 = 1 if sexactB07 > 3 & sexactA07 > 4
(214 real changes made)

. 
. egen sexactSuccess = rowtotal(sexactSuccess01 sexactSuccess02 sexactSuccess03 sexactSuccess04 sexactSuccess05 sexactSuccess06 sexactSuccess07)

. 
. drop sexactSuccess01 sexactSuccess02 sexactSuccess03 sexactSuccess04 sexactSuccess05 sexactSuccess06 sexactSuccess07

. 
. gen sexactFailure01 = 0

. gen sexactFailure02 = 0

. gen sexactFailure03 = 0

. gen sexactFailure04 = 0

. gen sexactFailure05 = 0

. gen sexactFailure06 = 0

. gen sexactFailure07 = 0

. 
. replace sexactFailure01 = -1 if sexactB01 > 3 & sexactA01 < 4   //Praktik ist regelmäßig Bestandteil und wird nicht gemacht
(59 real changes made)

. replace sexactFailure02 = -1 if sexactB02 > 3 & sexactA02 < 4   //<----ACHTUNG! Alle mittleren (4) Attitudes-Werte erhalten eine 0
(41 real changes made)

. replace sexactFailure03 = -1 if sexactB03 > 3 & sexactA03 < 4
(66 real changes made)

. replace sexactFailure04 = -1 if sexactB04 > 3 & sexactA04 < 4
(50 real changes made)

. replace sexactFailure05 = -1 if sexactB05 > 3 & sexactA05 < 4
(10 real changes made)

. replace sexactFailure06 = -1 if sexactB06 > 3 & sexactA06 < 4
(6 real changes made)

. replace sexactFailure07 = -1 if sexactB07 > 3 & sexactA07 < 4
(15 real changes made)

. 
. egen sexactFailure = rowtotal(sexactFailure01 sexactFailure02 sexactFailure03 sexactFailure04 sexactFailure05 sexactFailure06 sexactFailure07)

. 
. drop sexactFailure01 sexactFailure02 sexactFailure03 sexactFailure04 sexactFailure05 sexactFailure06 sexactFailure07

. 
. gen sexactBalance = sexactSuccess + sexactFailure                               //zieht negative Erfahrungen von Gesamtindex ab

. 
. egen sexactAmissingcount = rowmiss (sexactA01 sexactA02 sexactA03 sexactA04 sexactA05 sexactA06 sexactA07)

. egen sexactBmissingcount = rowmiss (sexactB01 sexactB02 sexactB03 sexactB04 sexactB05 sexactB06 sexactB07)

. 
. 
. //----------- Praktiken - Einstellungen -----------                     //99 - "kann ich nicht beurteilen", als missing umcodiert
. egen sexactAcount = anycount (sexactA01 - sexactA15), values(4 5 6 7)                   //alle Praktiken

. replace sexactAcount = .m if sexactA01 - sexactA15 == .m 
(0 real changes made)

. replace sexactAcount = .n if sexactAcount == .
(0 real changes made)

. replace sexactAcount = .k if sexactAcount == 0                                                                  //<----- entfernt alle, die nach Aufsummieren 0 haben, d.h. bei allen Praktiken keine Angab
> en gemacht haben
(4 real changes made, 4 to missing)

. tab sexactAcount, missing

  see notes |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        0.15        0.15
          2 |          6        0.46        0.62
          3 |         18        1.39        2.00
          4 |         36        2.77        4.77
          5 |         71        5.47       10.24
          6 |        130       10.01       20.25
          7 |        174       13.39       33.64
          8 |        213       16.40       50.04
          9 |        222       17.09       67.13
         10 |        163       12.55       79.68
         11 |        121        9.31       88.99
         12 |         74        5.70       94.69
         13 |         39        3.00       97.69
         14 |         18        1.39       99.08
         15 |          8        0.62       99.69
         .k |          4        0.31      100.00
------------+-----------------------------------
      Total |      1,299      100.00

. 
. egen sexactAcountother = anycount (sexactA06 - sexactA15), values(4 5 6 7)              //nur besondere Praktiken

. replace sexactAcountother = .m if sexactA06 - sexactA15 == .m 
(0 real changes made)

. replace sexactAcountother = .n if sexactAcountother == .
(0 real changes made)

. replace sexactAcountother = .k if sexactAcountother == 0                                                //<----- entfernt alle, die nach Aufsummieren 0 haben, d.h. bei allen Praktiken keine Angaben gemac
> ht haben
(40 real changes made, 40 to missing)

. tab sexactAcountother, missing

  see notes |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         97        7.47        7.47
          2 |        144       11.09       18.55
          3 |        255       19.63       38.18
          4 |        265       20.40       58.58
          5 |        193       14.86       73.44
          6 |        143       11.01       84.45
          7 |         86        6.62       91.07
          8 |         47        3.62       94.69
          9 |         20        1.54       96.23
         10 |          9        0.69       96.92
         .k |         40        3.08      100.00
------------+-----------------------------------
      Total |      1,299      100.00

. 
. 
. //----------- Beziehungsdauer -----------
. gen coupleduration_year_month = .                                                                                                       //generiert neue, leere Variable, die Beziehungsjahre in Monaten um
> gerechnet enthalten soll
(1,299 missing values generated)

. replace coupleduration_year_month = coupleduration_year * 12                                            //füllt leere Variable mit Beziehungsjahren umgerechnet in Monate
(1,033 real changes made)

. egen coupleduration = rowtotal (coupleduration_month coupleduration_year_month)         //rowtotal behandelt missings wie 0 -> füllt neue Variable coupleduration mit Monaten + Jahren (in Monaten)

. replace coupleduration = coupleduration/12                                                                                      //wandelt Angabe in Jahre um
(1,294 real changes made)

. replace coupleduration = .m if coupleduration/12 > age                                                          //entfernt unsinnige Werte, für die Beziehungsdauer größer ist als Alter
(0 real changes made)

. drop if coupleduration == 0     
(5 observations deleted)

. 
. tab coupleduration, missing             

coupledurat |
        ion |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0833333 |         19        1.47        1.47
   .1666667 |         24        1.85        3.32
        .25 |         30        2.32        5.64
   .3333333 |         28        2.16        7.81
   .4166667 |         31        2.40       10.20
         .5 |         39        3.01       13.21
   .5833333 |         21        1.62       14.84
   .6666667 |         22        1.70       16.54
        .75 |         13        1.00       17.54
   .8333333 |         20        1.55       19.09
   .9166667 |         13        1.00       20.09
          1 |         41        3.17       23.26
   1.083333 |         14        1.08       24.34
   1.166667 |         25        1.93       26.28
       1.25 |         22        1.70       27.98
   1.333333 |         15        1.16       29.13
   1.416667 |         11        0.85       29.98
        1.5 |         20        1.55       31.53
   1.583333 |         23        1.78       33.31
   1.666667 |         12        0.93       34.23
       1.75 |         19        1.47       35.70
   1.833333 |         15        1.16       36.86
   1.916667 |         15        1.16       38.02
          2 |         27        2.09       40.11
   2.083333 |         15        1.16       41.27
   2.166667 |         14        1.08       42.35
       2.25 |         18        1.39       43.74
   2.333333 |          8        0.62       44.36
   2.416667 |         16        1.24       45.60
        2.5 |         20        1.55       47.14
   2.583333 |         15        1.16       48.30
   2.666667 |         12        0.93       49.23
       2.75 |          9        0.70       49.92
   2.833333 |          8        0.62       50.54
   2.916667 |         13        1.00       51.55
          3 |         13        1.00       52.55
   3.083333 |         14        1.08       53.63
   3.166667 |         16        1.24       54.87
       3.25 |         11        0.85       55.72
   3.333333 |          6        0.46       56.18
   3.416667 |         13        1.00       57.19
        3.5 |         10        0.77       57.96
   3.583333 |         15        1.16       59.12
   3.666667 |          8        0.62       59.74
       3.75 |         10        0.77       60.51
   3.833333 |         10        0.77       61.28
   3.916667 |          5        0.39       61.67
          4 |         19        1.47       63.14
   4.083333 |          8        0.62       63.76
   4.166667 |         11        0.85       64.61
       4.25 |          6        0.46       65.07
   4.333333 |          4        0.31       65.38
   4.416667 |          8        0.62       66.00
        4.5 |         10        0.77       66.77
   4.583333 |          7        0.54       67.31
   4.666667 |          8        0.62       67.93
       4.75 |          3        0.23       68.16
   4.833333 |          7        0.54       68.70
   4.916667 |          8        0.62       69.32
          5 |         12        0.93       70.25
   5.083333 |          8        0.62       70.87
   5.166667 |          3        0.23       71.10
       5.25 |         10        0.77       71.87
   5.333333 |          5        0.39       72.26
   5.416667 |          8        0.62       72.87
        5.5 |          6        0.46       73.34
   5.583333 |         10        0.77       74.11
   5.666667 |          5        0.39       74.50
       5.75 |          7        0.54       75.04
   5.833333 |          2        0.15       75.19
   5.916667 |          7        0.54       75.73
          6 |          6        0.46       76.20
   6.083333 |          5        0.39       76.58
   6.166667 |          5        0.39       76.97
       6.25 |          4        0.31       77.28
   6.333333 |          5        0.39       77.67
   6.416667 |          5        0.39       78.05
        6.5 |          9        0.70       78.75
   6.583333 |          2        0.15       78.90
   6.666667 |          2        0.15       79.06
       6.75 |          2        0.15       79.21
   6.833333 |          7        0.54       79.75
   6.916667 |          3        0.23       79.98
          7 |          6        0.46       80.45
   7.083333 |          3        0.23       80.68
   7.166667 |          3        0.23       80.91
       7.25 |          4        0.31       81.22
   7.333333 |          5        0.39       81.61
   7.416667 |          4        0.31       81.92
        7.5 |          6        0.46       82.38
   7.583333 |          4        0.31       82.69
   7.666667 |          4        0.31       83.00
       7.75 |          5        0.39       83.38
   7.833333 |          5        0.39       83.77
          8 |          8        0.62       84.39
   8.083333 |          3        0.23       84.62
   8.166667 |          5        0.39       85.01
       8.25 |          2        0.15       85.16
   8.333333 |          1        0.08       85.24
   8.416667 |          6        0.46       85.70
        8.5 |          6        0.46       86.17
   8.583333 |          1        0.08       86.24
   8.666667 |          3        0.23       86.48
       8.75 |          1        0.08       86.55
   8.833333 |          1        0.08       86.63
   8.916667 |          2        0.15       86.79
          9 |          6        0.46       87.25
   9.083333 |          3        0.23       87.48
   9.166667 |          3        0.23       87.71
       9.25 |          2        0.15       87.87
   9.333333 |          5        0.39       88.25
   9.416667 |          1        0.08       88.33
        9.5 |          6        0.46       88.79
   9.583333 |          2        0.15       88.95
   9.666667 |          2        0.15       89.10
       9.75 |          2        0.15       89.26
   9.916667 |          1        0.08       89.34
         10 |          6        0.46       89.80
   10.08333 |          4        0.31       90.11
   10.16667 |          1        0.08       90.19
      10.25 |          5        0.39       90.57
   10.41667 |          4        0.31       90.88
       10.5 |          4        0.31       91.19
   10.58333 |          2        0.15       91.34
   10.66667 |          1        0.08       91.42
      10.75 |          1        0.08       91.50
   10.91667 |          1        0.08       91.58
         11 |          2        0.15       91.73
   11.08333 |          1        0.08       91.81
   11.16667 |          3        0.23       92.04
      11.25 |          1        0.08       92.12
   11.41667 |          1        0.08       92.19
       11.5 |          2        0.15       92.35
   11.83333 |          1        0.08       92.43
   11.91667 |          1        0.08       92.50
         12 |          6        0.46       92.97
   12.16667 |          3        0.23       93.20
      12.25 |          1        0.08       93.28
   12.33333 |          1        0.08       93.35
       12.5 |          2        0.15       93.51
   12.58333 |          3        0.23       93.74
      12.75 |          1        0.08       93.82
   12.83333 |          2        0.15       93.97
   12.91667 |          1        0.08       94.05
         13 |          1        0.08       94.13
   13.16667 |          2        0.15       94.28
      13.25 |          2        0.15       94.44
   13.33333 |          1        0.08       94.51
   13.41667 |          1        0.08       94.59
   13.58333 |          2        0.15       94.74
         14 |          3        0.23       94.98
   14.16667 |          1        0.08       95.05
      14.25 |          1        0.08       95.13
   14.33333 |          1        0.08       95.21
   14.41667 |          2        0.15       95.36
       14.5 |          1        0.08       95.44
   14.58333 |          1        0.08       95.52
   14.91667 |          1        0.08       95.60
         15 |          4        0.31       95.90
   15.08333 |          1        0.08       95.98
   15.16667 |          1        0.08       96.06
      15.25 |          2        0.15       96.21
   15.33333 |          2        0.15       96.37
       15.5 |          1        0.08       96.45
   15.58333 |          1        0.08       96.52
      15.75 |          3        0.23       96.75
   15.83333 |          1        0.08       96.83
   15.91667 |          1        0.08       96.91
         16 |          2        0.15       97.06
   16.41667 |          1        0.08       97.14
   16.66667 |          2        0.15       97.30
         17 |          1        0.08       97.37
   17.16667 |          1        0.08       97.45
       17.5 |          1        0.08       97.53
         18 |          3        0.23       97.76
      18.75 |          1        0.08       97.84
         19 |          2        0.15       97.99
   19.41667 |          1        0.08       98.07
       19.5 |          1        0.08       98.15
   19.83333 |          1        0.08       98.22
   21.58333 |          1        0.08       98.30
   21.66667 |          1        0.08       98.38
   23.08333 |          1        0.08       98.45
   23.16667 |          1        0.08       98.53
   23.83333 |          1        0.08       98.61
         25 |          1        0.08       98.69
   25.08333 |          1        0.08       98.76
      25.25 |          1        0.08       98.84
      25.75 |          1        0.08       98.92
         26 |          1        0.08       99.00
   27.41667 |          1        0.08       99.07
         28 |          1        0.08       99.15
   28.58333 |          1        0.08       99.23
   28.83333 |          1        0.08       99.30
   28.91667 |          1        0.08       99.38
         32 |          2        0.15       99.54
         34 |          1        0.08       99.61
      34.25 |          1        0.08       99.69
         36 |          1        0.08       99.77
   37.41667 |          1        0.08       99.85
         39 |          1        0.08       99.92
   45.16667 |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. sum coupleduration, detail      

                       coupleduration
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0833333       .0833333
 5%          .25       .0833333
10%     .4166667       .0833333       Obs               1,294
25%     1.166667       .0833333       Sum of Wgt.       1,294

50%     2.833333                      Mean           4.436373
                        Largest       Std. Dev.      5.127938
75%         5.75             36
90%     10.08333       37.41667       Variance       26.29575
95%     14.16667             39       Skewness       2.867699
99%     27.41667       45.16667       Kurtosis       15.09013

. 
. 
. //----------- Kategorisieren von Beziehungsdauer in drei Teile -----------
. 
. egen coupledurationCat = cut(coupleduration), group(3)

. recode coupledurationCat (0=1)(1=2)(2=3)
(coupledurationCat: 1294 changes made)

. tab coupledurationCat, missing

coupledurat |
     ionCat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        431       33.31       33.31
          2 |        423       32.69       66.00
          3 |        440       34.00      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Offenheit für Erfahrungen (Big 5) -----------
. egen bigfiveO = rowmean (bigfiveO01 bigfiveO02)                         
(1 missing value generated)

. replace bigfiveO = .m if bigfiveO01 == .m & bigfiveO02 == .m
(1 real change made, 1 to missing)

. replace bigfiveO = .n if bigfiveO == .
(0 real changes made)

. tab bigfiveO, missing

   bigfiveO |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        0.39        0.39
        1.5 |          3        0.23        0.62
          2 |          6        0.46        1.08
        2.5 |          9        0.70        1.78
          3 |         22        1.70        3.48
        3.5 |         32        2.47        5.95
          4 |         66        5.10       11.05
        4.5 |         93        7.19       18.24
          5 |        159       12.29       30.53
        5.5 |        189       14.61       45.13
          6 |        261       20.17       65.30
        6.5 |        186       14.37       79.68
          7 |        262       20.25       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //Alternative zum Messmodell für SEM mit Mittelwerten der latenten Variablen
. egen sexsatMean = rowmean (sexsat01 sexsat02 sexsat03)

. egen coupleMean = rowmean (couplebond01 couplebond02 coupleint01)
(2 missing values generated)

. egen distractMean = rowmean (sexnet01 sexnet02)                         
(1 missing value generated)

. 
. log close
      name:  <unnamed>
       log:  \log\02_Variablen_Review_Indexbildung.log
  log type:  text
 closed on:  25 May 2022, 15:36:31
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
