-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \log\03_Erhebung_Variablen_Beschreibung.log
  log type:  text
 opened on:  25 May 2022, 15:36:31

. 
. 
. //************ benutzte Variablen Beschreibung + Kurtosis, Skewness, Sktest, SWilk ************
. 
. //Beschreibung
. 
. tab gender, missing

      Geschlecht |      Freq.     Percent        Cum.
-----------------+-----------------------------------
        Weiblich |      1,294      100.00      100.00
-----------------+-----------------------------------
           Total |      1,294      100.00

. 
. gen ageCat = .                                                                                          //Alterskategorien
(1,294 missing values generated)

. replace ageCat = 1 if age <18
(8 real changes made)

. replace ageCat = 2 if age >17 & age <25
(483 real changes made)

. replace ageCat = 3 if age >24 & age <30
(408 real changes made)

. replace ageCat = 4 if age >29 & age <35
(181 real changes made)

. replace ageCat = 5 if age >34 & age <40
(104 real changes made)

. replace ageCat = 6 if age >39 & age <45
(51 real changes made)

. replace ageCat = 7 if age >44 & age <50
(26 real changes made)

. replace ageCat = 8 if age >49
(33 real changes made)

. replace ageCat = .m if age == .m
(5 real changes made, 5 to missing)

. tab ageCat, missing

     ageCat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        0.62        0.62
          2 |        483       37.33       37.94
          3 |        408       31.53       69.47
          4 |        181       13.99       83.46
          5 |        104        8.04       91.50
          6 |         51        3.94       95.44
          7 |         26        2.01       97.45
          8 |         28        2.16       99.61
         .m |          5        0.39      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. tab ageCat gender, missing

           | Geschlecht
    ageCat |  Weiblich |     Total
-----------+-----------+----------
         1 |         8 |         8 
         2 |       483 |       483 
         3 |       408 |       408 
         4 |       181 |       181 
         5 |       104 |       104 
         6 |        51 |        51 
         7 |        26 |        26 
         8 |        28 |        28 
        .m |         5 |         5 
-----------+-----------+----------
     Total |     1,294 |     1,294 


. 
. gen coupledurationCatZehn = .
(1,294 missing values generated)

. replace coupledurationCatZehn = 1 if coupleduration <=1
(301 real changes made)

. replace coupledurationCatZehn = 2 if coupleduration >1 & coupleduration <=2
(218 real changes made)

. replace coupledurationCatZehn = 3 if coupleduration >2 & coupleduration <=3
(161 real changes made)

. replace coupledurationCatZehn = 4 if coupleduration >3 & coupleduration <=4
(137 real changes made)

. replace coupledurationCatZehn = 5 if coupleduration >4 & coupleduration <=5
(92 real changes made)

. replace coupledurationCatZehn = 6 if coupleduration >5 & coupleduration <=6
(77 real changes made)

. replace coupledurationCatZehn = 7 if coupleduration >6 & coupleduration <=7
(55 real changes made)

. replace coupledurationCatZehn = 8 if coupleduration >7 & coupleduration <=8
(51 real changes made)

. replace coupledurationCatZehn = 9 if coupleduration >8 & coupleduration <=9
(37 real changes made)

. replace coupledurationCatZehn = 10 if coupleduration >9 & coupleduration <=10
(33 real changes made)

. replace coupledurationCatZehn = 11 if coupleduration >10
(132 real changes made)

. 
. tab coupledurationCatZehn, missing

coupledurat |
 ionCatZehn |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        301       23.26       23.26
          2 |        218       16.85       40.11
          3 |        161       12.44       52.55
          4 |        137       10.59       63.14
          5 |         92        7.11       70.25
          6 |         77        5.95       76.20
          7 |         55        4.25       80.45
          8 |         51        3.94       84.39
          9 |         37        2.86       87.25
         10 |         33        2.55       89.80
         11 |        132       10.20      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. //endogen
. sum sexactBalance sexorgasm01 sexquan sexfan02

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
sexactBala~e |      1,294    3.695518    1.692994         -3          7
 sexorgasm01 |      1,287    4.629371    2.020542          1          7
     sexquan |      1,294    3.409583    .9914254          1          5
    sexfan02 |      1,292    3.947368    1.670452          1          7

. sum sexactBalance sexorgasm01 sexquan sexfan02, detail

                        sexactBalance
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -3
 5%            1             -1
10%            1             -1       Obs               1,294
25%            3             -1       Sum of Wgt.       1,294

50%            4                      Mean           3.695518
                        Largest       Std. Dev.      1.692994
75%            5              7
90%            5              7       Variance       2.866229
95%            6              7       Skewness      -.6240896
99%            7              7       Kurtosis       2.998092

        Beim Sex habe ich in den meisten Fällen auch
                       einen Orgasmus.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               1,287
25%            3              1       Sum of Wgt.       1,287

50%            5                      Mean           4.629371
                        Largest       Std. Dev.      2.020542
75%            6              7
90%            7              7       Variance       4.082589
95%            7              7       Skewness      -.4948848
99%            7              7       Kurtosis       1.972356

                           sexquan
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            2              1       Obs               1,294
25%            3              1       Sum of Wgt.       1,294

50%            3                      Mean           3.409583
                        Largest       Std. Dev.      .9914254
75%            4              5
90%            5              5       Variance       .9829243
95%            5              5       Skewness      -.0750702
99%            5              5       Kurtosis       2.348281

          Wenn ich meine Gedanken schweifen lasse,
          entwickeln sich häufig sexuelle Fantasi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs               1,292
25%            3              1       Sum of Wgt.       1,292

50%            4                      Mean           3.947368
                        Largest       Std. Dev.      1.670452
75%            5              7
90%            6              7       Variance       2.790411
95%            7              7       Skewness       .0413928
99%            7              7       Kurtosis       2.102507

. 
. sktest sexactBalance sexorgasm01 sexquan sexfan02, noadjust

                    Skewness/Kurtosis tests for Normality
                                                          ------ joint ------
    Variable |        Obs  Pr(Skewness)  Pr(Kurtosis)     chi2(2)   Prob>chi2
-------------+---------------------------------------------------------------
sexactBala~e |      1,294     0.0000        0.9310       72.38         0.0000
 sexorgasm01 |      1,287     0.0000        0.0000      370.99         0.0000
     sexquan |      1,294     0.2682        0.0000       53.62         0.0000
    sexfan02 |      1,292     0.5414        0.0000      168.51         0.0000

. swilk sexactBalance sexorgasm01 sexquan sexfan02

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
sexactBala~e |      1,294    0.97572     19.366     7.415    0.00000
 sexorgasm01 |      1,287    0.97343     21.092     7.627    0.00000
     sexquan |      1,294    0.99812      1.496     1.008    0.15664
    sexfan02 |      1,292    0.99421      4.610     3.824    0.00007

. 
. //endogen - Messmodell
. sum sexnet01 sexnet02 couplebond01 couplebond02 coupleint01 sexsat01 sexsat02 sexsat03

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    sexnet01 |      1,292    3.451238    2.096053          1          7
    sexnet02 |      1,292    3.852167    1.878733          1          7
couplebond01 |      1,286    6.217729    1.214387          1          7
couplebond02 |      1,286     6.01633    1.514818          1          7
 coupleint01 |      1,287    6.025641     1.33739          1          7
-------------+---------------------------------------------------------
    sexsat01 |      1,290    5.142636    1.710587          1          7
    sexsat02 |      1,293    5.140758    1.675812          1          7
    sexsat03 |      1,289    4.205586    1.776861          1          7

. sum sexnet01 sexnet02 couplebond01 couplebond02 coupleint01 sexsat01 sexsat02 sexsat03, detail 

      Ich mache mir beim Sex häufig Gedanken, ob mich
               mein Partner attraktiv findet.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               1,292
25%            1              1       Sum of Wgt.       1,292

50%            3                      Mean           3.451238
                        Largest       Std. Dev.      2.096053
75%            5              7
90%            7              7       Variance       4.393438
95%            7              7       Skewness       .2977196
99%            7              7       Kurtosis       1.688914

       Ich versuche beim Sex bewusst alles richtig zu
                           machen.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               1,292
25%            2              1       Sum of Wgt.       1,292

50%            4                      Mean           3.852167
                        Largest       Std. Dev.      1.878733
75%            5              7
90%            6              7       Variance       3.529639
95%            7              7       Skewness       .0081906
99%            7              7       Kurtosis       1.884374

       Ich fühle mich meinem Partner sehr verbunden.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              1
 5%            4              1
10%            4              1       Obs               1,286
25%            6              1       Sum of Wgt.       1,286

50%            7                      Mean           6.217729
                        Largest       Std. Dev.      1.214387
75%            7              7
90%            7              7       Variance       1.474736
95%            7              7       Skewness      -1.838405
99%            7              7       Kurtosis       6.229992

         Ich kann mir vorstellen mit meinem jetzigen
            Partner für immer zusammen zu bleibe
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            4              1       Obs               1,286
25%            5              1       Sum of Wgt.       1,286

50%            7                      Mean            6.01633
                        Largest       Std. Dev.      1.514818
75%            7              7
90%            7              7       Variance       2.294675
95%            7              7       Skewness      -1.684559
99%            7              7       Kurtosis       5.160161

       Mein Partner und ich stehen uns emotional sehr
                            nahe.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            4              1       Obs               1,287
25%            5              1       Sum of Wgt.       1,287

50%            7                      Mean           6.025641
                        Largest       Std. Dev.       1.33739
75%            7              7
90%            7              7       Variance       1.788611
95%            7              7       Skewness      -1.566812
99%            7              7       Kurtosis       5.176034

          Mit meiner Sexualität bin ich vollkommen
                         zufrieden.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            2              1       Obs               1,290
25%            4              1       Sum of Wgt.       1,290

50%            6                      Mean           5.142636
                        Largest       Std. Dev.      1.710587
75%            6              7
90%            7              7       Variance       2.926109
95%            7              7       Skewness      -.8493334
99%            7              7       Kurtosis       2.768796

         Ich habe ein erfülltes und befriedigendes
                        Sexualleben.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            3              1       Obs               1,293
25%            4              1       Sum of Wgt.       1,293

50%            6                      Mean           5.140758
                        Largest       Std. Dev.      1.675812
75%            6              7
90%            7              7       Variance       2.808345
95%            7              7       Skewness      -.7913246
99%            7              7       Kurtosis       2.758061

        Es gibt nichts, was ich an meinem Sexualleben
                     verändern möchte.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs               1,289
25%            3              1       Sum of Wgt.       1,289

50%            4                      Mean           4.205586
                        Largest       Std. Dev.      1.776861
75%            6              7
90%            7              7       Variance       3.157236
95%            7              7       Skewness      -.1177177
99%            7              7       Kurtosis       1.943305

. 
. sktest sexnet01 sexnet02 couplebond01 couplebond02 coupleint01 sexsat01 sexsat02 sexsat03, noadjust

                    Skewness/Kurtosis tests for Normality
                                                          ------ joint ------
    Variable |        Obs  Pr(Skewness)  Pr(Kurtosis)     chi2(2)   Prob>chi2
-------------+---------------------------------------------------------------
    sexnet01 |      1,292     0.0000        0.0000     3843.15         0.0000
    sexnet02 |      1,292     0.9038        0.0000      540.56         0.0000
couplebond01 |      1,286     0.0000        0.0000      452.73         0.0000
couplebond02 |      1,286     0.0000        0.0000      383.59         0.0000
 coupleint01 |      1,287     0.0000        0.0000      357.19         0.0000
    sexsat01 |      1,290     0.0000        0.0671      123.72         0.0000
    sexsat02 |      1,293     0.0000        0.0528      111.43         0.0000
    sexsat03 |      1,289     0.0837        0.0000      382.93         0.0000

. swilk sexnet01 sexnet02 couplebond01 couplebond02 coupleint01 sexsat01 sexsat02 sexsat03

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
    sexnet01 |      1,292    0.97758     17.857     7.212    0.00000
    sexnet02 |      1,292    0.99169      6.618     4.728    0.00000
couplebond01 |      1,286    0.92085     62.781    10.355    0.00000
couplebond02 |      1,286    0.92632     58.440    10.176    0.00000
 coupleint01 |      1,287    0.93873     48.636     9.717    0.00000
    sexsat01 |      1,290    0.96028     31.595     8.639    0.00000
    sexsat02 |      1,293    0.97088     23.212     7.868    0.00000
    sexsat03 |      1,289    0.98938      8.438     5.336    0.00000

. 
. //exogen 
. sum sexmastB01 sexpornB01 sexcomm01

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  sexmastB01 |      1,292    4.455108    2.054335          1          7
  sexpornB01 |      1,293    3.126063    1.908197          1          7
   sexcomm01 |      1,291    4.901627    2.142683          1          7

. sum sexmastB01 sexpornB01 sexcomm01, detail

          Ich befriedige mich regelmäßig selbst.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               1,292
25%            3              1       Sum of Wgt.       1,292

50%            5                      Mean           4.455108
                        Largest       Std. Dev.      2.054335
75%            6              7
90%            7              7       Variance       4.220291
95%            7              7       Skewness      -.3266409
99%            7              7       Kurtosis       1.807563

       Ich sehe mir regelmäßig erotische Bilder oder
                         Videos an.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               1,293
25%            1              1       Sum of Wgt.       1,293

50%            3                      Mean           3.126063
                        Largest       Std. Dev.      1.908197
75%            5              7
90%            6              7       Variance       3.641216
95%            7              7       Skewness       .5711488
99%            7              7       Kurtosis       2.134741

       Es fällt mir nicht leicht, mit meinem Partner
               über Sexualität zu sprechen.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               1,291
25%            3              1       Sum of Wgt.       1,291

50%            6                      Mean           4.901627
                        Largest       Std. Dev.      2.142683
75%            7              7
90%            7              7       Variance        4.59109
95%            7              7       Skewness       -.601485
99%            7              7       Kurtosis       1.907885

. 
. sktest sexmastB01 sexpornB01 sexcomm01, noadjust

                    Skewness/Kurtosis tests for Normality
                                                          ------ joint ------
    Variable |        Obs  Pr(Skewness)  Pr(Kurtosis)     chi2(2)   Prob>chi2
-------------+---------------------------------------------------------------
  sexmastB01 |      1,292     0.0000        0.0000      950.39         0.0000
  sexpornB01 |      1,293     0.0000        0.0000      206.18         0.0000
   sexcomm01 |      1,291     0.0000        0.0000      535.13         0.0000

. swilk sexmastB01 sexpornB01 sexcomm01

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
  sexmastB01 |      1,292    0.98307     13.488     6.510    0.00000
  sexpornB01 |      1,293    0.97510     19.850     7.477    0.00000
   sexcomm01 |      1,291    0.96720     26.109     8.162    0.00000

. 
. 
. //Kontrollvariablen
. 
. sum age education stress01 healthphys01 bigfiveO coupleduration

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,289    27.94182    7.431605         16         68
   education |      1,294    4.319938    1.053681          1          7
    stress01 |      1,293    5.041763    1.814489          1          7
healthphys01 |      1,291    5.245546    2.041272          1          7
    bigfiveO |      1,293    5.682908    1.129396          1          7
-------------+---------------------------------------------------------
coupledur~on |      1,294    4.436373    5.127938   .0833333   45.16667

. sum age education stress01 healthphys01 bigfiveO coupleduration, detail

                            Alter
-------------------------------------------------------------
      Percentiles      Smallest
 1%           18             16
 5%           20             17
10%           21             17       Obs               1,289
25%           23             17       Sum of Wgt.       1,289

50%           26                      Mean           27.94182
                        Largest       Std. Dev.      7.431605
75%           31             59
90%           38             60       Variance       55.22875
95%           44             66       Skewness       1.549642
99%           54             68       Kurtosis       6.016147

                           Bildung
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              1
 5%            3              1
10%            3              2       Obs               1,294
25%            4              2       Sum of Wgt.       1,294

50%            4                      Mean           4.319938
                        Largest       Std. Dev.      1.053681
75%            5              7
90%            6              7       Variance       1.110244
95%            6              7       Skewness       .1837044
99%            6              7       Kurtosis       2.580296

       Innerhalb der letzten 6 Monate hatte ich immer
             wieder großen beruflichen und/ode
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs               1,293
25%            4              1       Sum of Wgt.       1,293

50%            5                      Mean           5.041763
                        Largest       Std. Dev.      1.814489
75%            7              7
90%            7              7       Variance       3.292372
95%            7              7       Skewness      -.6989985
99%            7              7       Kurtosis       2.453352

          Innerhalb der letzten 6 Monate hatte ich
          körperliche Probleme, die meine Lebensq
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs               1,291
25%            4              1       Sum of Wgt.       1,291

50%            6                      Mean           5.245546
                        Largest       Std. Dev.      2.041272
75%            7              7
90%            7              7       Variance       4.166792
95%            7              7       Skewness      -.8415146
99%            7              7       Kurtosis       2.297829

                          bigfiveO
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              1
 5%          3.5              1
10%            4              1       Obs               1,293
25%            5              1       Sum of Wgt.       1,293

50%            6                      Mean           5.682908
                        Largest       Std. Dev.      1.129396
75%          6.5              7
90%            7              7       Variance       1.275536
95%            7              7       Skewness      -1.017234
99%            7              7       Kurtosis        4.20731

                       coupleduration
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0833333       .0833333
 5%          .25       .0833333
10%     .4166667       .0833333       Obs               1,294
25%     1.166667       .0833333       Sum of Wgt.       1,294

50%     2.833333                      Mean           4.436373
                        Largest       Std. Dev.      5.127938
75%         5.75             36
90%     10.08333       37.41667       Variance       26.29575
95%     14.16667             39       Skewness       2.867699
99%     27.41667       45.16667       Kurtosis       15.09013

. 
. sktest age education stress01 healthphys01 bigfiveO coupleduration, noadjust

                    Skewness/Kurtosis tests for Normality
                                                          ------ joint ------
    Variable |        Obs  Pr(Skewness)  Pr(Kurtosis)     chi2(2)   Prob>chi2
-------------+---------------------------------------------------------------
         age |      1,289     0.0000        0.0000      380.98         0.0000
   education |      1,294     0.0071        0.0001       22.09         0.0000
    stress01 |      1,293     0.0000        0.0000      118.45         0.0000
healthphys01 |      1,291     0.0000        0.0000      185.37         0.0000
    bigfiveO |      1,293     0.0000        0.0000      193.72         0.0000
coupledur~on |      1,294     0.0000        0.0000      831.84         0.0000

. swilk age education stress01 healthphys01 bigfiveO coupleduration

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
         age |      1,289    0.87915     96.056    11.420    0.00000
   education |      1,294    0.99104      7.146     4.920    0.00000
    stress01 |      1,293    0.97716     18.206     7.260    0.00000
healthphys01 |      1,291    0.95981     31.987     8.670    0.00000
    bigfiveO |      1,293    0.95912     32.587     8.717    0.00000
coupledur~on |      1,294    0.72515    219.244    13.487    0.00000

. 
. 
. //Verteilung und missings Tabellen
. 
. tab1 sexactBalance sexorgasm01 sexquan sexfan02, missing nolabel

-> tabulation of sexactBalance  

sexactBalan |
         ce |      Freq.     Percent        Cum.
------------+-----------------------------------
         -3 |          1        0.08        0.08
         -1 |         18        1.39        1.47
          0 |         43        3.32        4.79
          1 |         94        7.26       12.06
          2 |        134       10.36       22.41
          3 |        242       18.70       41.11
          4 |        244       18.86       59.97
          5 |        394       30.45       90.42
          6 |         99        7.65       98.07
          7 |         25        1.93      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexorgasm01  

   Beim Sex |
habe ich in |
den meisten |
     Fällen |
 auch einen |
  Orgasmus. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        149       11.51       11.51
          2 |        118        9.12       20.63
          3 |        104        8.04       28.67
          4 |        155       11.98       40.65
          5 |        212       16.38       57.03
          6 |        262       20.25       77.28
          7 |        287       22.18       99.46
         .m |          7        0.54      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexquan  

    sexquan |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23        1.78        1.78
          2 |        216       16.69       18.47
          3 |        457       35.32       53.79
          4 |        404       31.22       85.01
          5 |        194       14.99      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexfan02  

   Wenn ich |
      meine |
   Gedanken |
  schweifen |
     lasse, |
 entwickeln |
       sich |
     häufig |
   sexuelle |
    Fantasi |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         86        6.65        6.65
          2 |        226       17.47       24.11
          3 |        210       16.23       40.34
          4 |        256       19.78       60.12
          5 |        271       20.94       81.07
          6 |        148       11.44       92.50
          7 |         95        7.34       99.85
         .m |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. tab1 sexactA01-sexactA07, missing nolabel

-> tabulation of sexactA01  

  Oralsex - |
      aktiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         49        3.79        3.79
          2 |         56        4.33        8.11
          3 |         95        7.34       15.46
          4 |        120        9.27       24.73
          5 |        206       15.92       40.65
          6 |        285       22.02       62.67
          7 |        460       35.55       98.22
         .m |          1        0.08       98.30
         .n |         22        1.70      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactA02  

  Oralsex - |
     passiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         41        3.17        3.17
          2 |         52        4.02        7.19
          3 |         75        5.80       12.98
          4 |        105        8.11       21.10
          5 |        160       12.36       33.46
          6 |        216       16.69       50.15
          7 |        610       47.14       97.30
         .k |          1        0.08       97.37
         .m |          1        0.08       97.45
         .n |         33        2.55      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactA03  

  Manueller |
Sex - aktiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         13        1.00        1.00
          2 |         36        2.78        3.79
          3 |         70        5.41        9.20
          4 |        177       13.68       22.87
          5 |        242       18.70       41.58
          6 |        307       23.72       65.30
          7 |        407       31.45       96.75
         .k |          1        0.08       96.83
         .n |         41        3.17      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactA04  

  Manueller |
      Sex - |
     passiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14        1.08        1.08
          2 |         34        2.63        3.71
          3 |         58        4.48        8.19
          4 |        113        8.73       16.92
          5 |        194       14.99       31.92
          6 |        277       21.41       53.32
          7 |        560       43.28       96.60
         .m |          1        0.08       96.68
         .n |         43        3.32      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactA05  

 Vaginalsex |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        0.39        0.39
          2 |          1        0.08        0.46
          3 |          9        0.70        1.16
          4 |         26        2.01        3.17
          5 |         63        4.87        8.04
          6 |        173       13.37       21.41
          7 |        988       76.35       97.76
         .k |          2        0.15       97.91
         .n |         27        2.09      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactA06  

  Analsex - |
      aktiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        371       28.67       28.67
          2 |         66        5.10       33.77
          3 |         32        2.47       36.24
          4 |         43        3.32       39.57
          5 |         39        3.01       42.58
          6 |         34        2.63       45.21
          7 |         38        2.94       48.15
         .k |         27        2.09       50.23
         .n |        644       49.77      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactA07  

  Analsex - |
     passiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        365       28.21       28.21
          2 |        104        8.04       36.24
          3 |         88        6.80       43.04
          4 |         93        7.19       50.23
          5 |        124        9.58       59.81
          6 |         96        7.42       67.23
          7 |         84        6.49       73.72
         .k |         11        0.85       74.57
         .n |        329       25.43      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. tab1 sexactB01-sexactB07, missing nolabel

-> tabulation of sexactB01  

  Oralsex - |
      aktiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         91        7.03        7.03
          2 |         89        6.88       13.91
          3 |        100        7.73       21.64
          4 |        119        9.20       30.83
          5 |        250       19.32       50.15
          6 |        247       19.09       69.24
          7 |        396       30.60       99.85
         .m |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactB02  

  Oralsex - |
     passiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        127        9.81        9.81
          2 |        158       12.21       22.02
          3 |        128        9.89       31.92
          4 |        138       10.66       42.58
          5 |        184       14.22       56.80
          6 |        237       18.32       75.12
          7 |        321       24.81       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactB03  

  Manueller |
Sex - aktiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         49        3.79        3.79
          2 |         56        4.33        8.11
          3 |         81        6.26       14.37
          4 |        159       12.29       26.66
          5 |        238       18.39       45.05
          6 |        315       24.34       69.40
          7 |        390       30.14       99.54
         .m |          6        0.46      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactB04  

  Manueller |
      Sex - |
     passiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         63        4.87        4.87
          2 |         66        5.10        9.97
          3 |         90        6.96       16.92
          4 |        148       11.44       28.36
          5 |        219       16.92       45.29
          6 |        276       21.33       66.62
          7 |        421       32.53       99.15
         .m |         11        0.85      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactB05  

 Vaginalsex |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         19        1.47        1.47
          2 |         13        1.00        2.47
          3 |          6        0.46        2.94
          4 |         26        2.01        4.95
          5 |         50        3.86        8.81
          6 |        186       14.37       23.18
          7 |        993       76.74       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactB06  

  Analsex - |
      aktiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,122       86.71       86.71
          2 |         62        4.79       91.50
          3 |         37        2.86       94.36
          4 |         18        1.39       95.75
          5 |         22        1.70       97.45
          6 |         10        0.77       98.22
          7 |         17        1.31       99.54
         .m |          6        0.46      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactB07  

  Analsex - |
     passiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        801       61.90       61.90
          2 |        158       12.21       74.11
          3 |         89        6.88       80.99
          4 |         66        5.10       86.09
          5 |         84        6.49       92.58
          6 |         40        3.09       95.67
          7 |         52        4.02       99.69
         .m |          4        0.31      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. tab1 sexactSuccess sexactFailure sexactBalance, missing nolabel

-> tabulation of sexactSuccess  

sexactSucce |
         ss |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         17        1.31        1.31
          1 |         70        5.41        6.72
          2 |        142       10.97       17.70
          3 |        262       20.25       37.94
          4 |        275       21.25       59.20
          5 |        404       31.22       90.42
          6 |         99        7.65       98.07
          7 |         25        1.93      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactFailure  

sexactFailu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
         -4 |          1        0.08        0.08
         -3 |          7        0.54        0.62
         -2 |         40        3.09        3.71
         -1 |        142       10.97       14.68
          0 |      1,104       85.32      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexactBalance  

sexactBalan |
         ce |      Freq.     Percent        Cum.
------------+-----------------------------------
         -3 |          1        0.08        0.08
         -1 |         18        1.39        1.47
          0 |         43        3.32        4.79
          1 |         94        7.26       12.06
          2 |        134       10.36       22.41
          3 |        242       18.70       41.11
          4 |        244       18.86       59.97
          5 |        394       30.45       90.42
          6 |         99        7.65       98.07
          7 |         25        1.93      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. tab1 sexnet01 sexnet02 couplebond01 couplebond02 coupleint01 sexsat01 sexsat02 sexsat03, missing nolabel

-> tabulation of sexnet01  

  Ich mache |
   mir beim |
 Sex häufig |
  Gedanken, |
    ob mich |
       mein |
    Partner |
  attraktiv |
    findet. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        335       25.89       25.89
          2 |        236       18.24       44.13
          3 |        114        8.81       52.94
          4 |        139       10.74       63.68
          5 |        193       14.91       78.59
          6 |        136       10.51       89.10
          7 |        139       10.74       99.85
         .m |          1        0.08       99.92
         .n |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexnet02  

        Ich |
   versuche |
   beim Sex |
    bewusst |
      alles |
 richtig zu |
    machen. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        186       14.37       14.37
          2 |        190       14.68       29.06
          3 |        183       14.14       43.20
          4 |        201       15.53       58.73
          5 |        255       19.71       78.44
          6 |        156       12.06       90.49
          7 |        121        9.35       99.85
         .m |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of couplebond01  

  Ich fühle |
mich meinem |
    Partner |
       sehr |
 verbunden. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        0.62        0.62
          2 |         17        1.31        1.93
          3 |         36        2.78        4.71
          4 |         69        5.33       10.05
          5 |        125        9.66       19.71
          6 |        272       21.02       40.73
          7 |        759       58.66       99.38
         .m |          3        0.23       99.61
         .n |          5        0.39      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of couplebond02  

   Ich kann |
        mir |
 vorstellen |
 mit meinem |
   jetzigen |
    Partner |
  für immer |
zusammen zu |
     bleibe |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         33        2.55        2.55
          2 |         32        2.47        5.02
          3 |         39        3.01        8.04
          4 |         97        7.50       15.53
          5 |        124        9.58       25.12
          6 |        212       16.38       41.50
          7 |        749       57.88       99.38
         .m |          2        0.15       99.54
         .n |          6        0.46      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of coupleint01  

       Mein |
Partner und |
 ich stehen |
        uns |
  emotional |
 sehr nahe. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         16        1.24        1.24
          2 |         20        1.55        2.78
          3 |         41        3.17        5.95
          4 |         95        7.34       13.29
          5 |        163       12.60       25.89
          6 |        283       21.87       47.76
          7 |        669       51.70       99.46
         .m |          1        0.08       99.54
         .n |          6        0.46      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexsat01  

 Mit meiner |
 Sexualität |
    bin ich |
 vollkommen |
 zufrieden. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         56        4.33        4.33
          2 |         77        5.95       10.28
          3 |        115        8.89       19.17
          4 |        131       10.12       29.29
          5 |        220       17.00       46.29
          6 |        382       29.52       75.81
          7 |        309       23.88       99.69
         .m |          4        0.31      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexsat02  

   Ich habe |
        ein |
  erfülltes |
        und |
befriedigen |
        des |
Sexualleben |
          . |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         48        3.71        3.71
          2 |         75        5.80        9.51
          3 |        116        8.96       18.47
          4 |        138       10.66       29.13
          5 |        267       20.63       49.77
          6 |        329       25.43       75.19
          7 |        320       24.73       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexsat03  

    Es gibt |
nichts, was |
     ich an |
     meinem |
Sexualleben |
  verändern |
    möchte. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         96        7.42        7.42
          2 |        152       11.75       19.17
          3 |        258       19.94       39.10
          4 |        174       13.45       52.55
          5 |        235       18.16       70.71
          6 |        242       18.70       89.41
          7 |        132       10.20       99.61
         .m |          5        0.39      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. tab1 sexmastB01 sexpornB01 sexcomm01, missing nolabel

-> tabulation of sexmastB01  

        Ich |
 befriedige |
       mich |
  regelmäßi |
  g selbst. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        159       12.29       12.29
          2 |        144       11.13       23.42
          3 |        129        9.97       33.38
          4 |        143       11.05       44.44
          5 |        236       18.24       62.67
          6 |        197       15.22       77.90
          7 |        284       21.95       99.85
         .m |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexpornB01  

   Ich sehe |
        mir |
  regelmäßi |
g erotische |
Bilder oder |
 Videos an. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        331       25.58       25.58
          2 |        298       23.03       48.61
          3 |        160       12.36       60.97
          4 |        162       12.52       73.49
          5 |        159       12.29       85.78
          6 |         89        6.88       92.66
          7 |         94        7.26       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of sexcomm01  

   Es fällt |
  mir nicht |
leicht, mit |
     meinem |
    Partner |
       über |
 Sexualität |
         zu |
  sprechen. |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        143       11.05       11.05
          2 |        111        8.58       19.63
          3 |        123        9.51       29.13
          4 |        111        8.58       37.71
          5 |        123        9.51       47.22
          6 |        225       17.39       64.61
          7 |        455       35.16       99.77
         .m |          1        0.08       99.85
         .n |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. tab1 ageCat education stress01 healthphys01 bigfiveO coupledurationCatZehn, missing nolabel

-> tabulation of ageCat  

     ageCat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        0.62        0.62
          2 |        483       37.33       37.94
          3 |        408       31.53       69.47
          4 |        181       13.99       83.46
          5 |        104        8.04       91.50
          6 |         51        3.94       95.44
          7 |         26        2.01       97.45
          8 |         28        2.16       99.61
         .m |          5        0.39      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of education  

    Bildung |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        0.15        0.15
          2 |         32        2.47        2.63
          3 |        224       17.31       19.94
          4 |        564       43.59       63.52
          5 |        245       18.93       82.46
          6 |        218       16.85       99.30
          7 |          9        0.70      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of stress01  

  Innerhalb |
der letzten |
   6 Monate |
  hatte ich |
      immer |
     wieder |
     großen |
beruflichen |
    und/ode |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         69        5.33        5.33
          2 |         96        7.42       12.75
          3 |        112        8.66       21.41
          4 |        132       10.20       31.61
          5 |        277       21.41       53.01
          6 |        240       18.55       71.56
          7 |        367       28.36       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of healthphys01  

  Innerhalb |
der letzten |
   6 Monate |
  hatte ich |
 körperlich |
e Probleme, |
  die meine |
    Lebensq |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        104        8.04        8.04
          2 |         77        5.95       13.99
          3 |        138       10.66       24.65
          4 |         94        7.26       31.92
          5 |        102        7.88       39.80
          6 |        218       16.85       56.65
          7 |        558       43.12       99.77
         .m |          3        0.23      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of bigfiveO  

   bigfiveO |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        0.39        0.39
        1.5 |          3        0.23        0.62
          2 |          6        0.46        1.08
        2.5 |          9        0.70        1.78
          3 |         22        1.70        3.48
        3.5 |         32        2.47        5.95
          4 |         66        5.10       11.05
        4.5 |         93        7.19       18.24
          5 |        159       12.29       30.53
        5.5 |        189       14.61       45.13
          6 |        261       20.17       65.30
        6.5 |        186       14.37       79.68
          7 |        262       20.25       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

-> tabulation of coupledurationCatZehn  

coupledurat |
 ionCatZehn |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        301       23.26       23.26
          2 |        218       16.85       40.11
          3 |        161       12.44       52.55
          4 |        137       10.59       63.14
          5 |         92        7.11       70.25
          6 |         77        5.95       76.20
          7 |         55        4.25       80.45
          8 |         51        3.94       84.39
          9 |         37        2.86       87.25
         10 |         33        2.55       89.80
         11 |        132       10.20      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. log close
      name:  <unnamed>
       log:  \log\03_Erhebung_Variablen_Beschreibung.log
  log type:  text
 closed on:  25 May 2022, 15:36:33
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
