------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \log\09_Missing_Check.log
  log type:  text
 opened on:  15 May 2022, 18:20:19

. 
. //###############################################################
. 
. //************ Missing Check ************
. // Test auf systematische Verzerrung der Stichprobe
. 
. egen includedInSem = rowmiss(sexsat01 sexsat02 sexsat03 sexactBalance sexorgasm01 sexquan sexmastB01 sexpornB01 sexfan02 sexcomm01 sexnet01 sexnet02 coupl
> ebond01 couplebond02 coupleint01)

. replace includedInSem = 1 if includedInSem > 0
(7 real changes made)

. 
. tab includedInSem

includedInS |
         em |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,255       96.99       96.99
          1 |         39        3.01      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. display "variable;p.value;t.value;sample.average;sample.sd;missing.average;missing.sd;d;d-lb;d-ub"  
variable;p.value;t.value;sample.average;sample.sd;missing.average;missing.sd;d;d-lb;d-ub

. foreach var of varlist sexsat01 sexsat02 sexsat03 sexquan sexorgasm01 sexactBalance sexfan02 sexmastB01 sexpornB01 sexnet01 sexnet02 couplebond01 couplebo
> nd02 coupleint01 sexcomm01 coupleduration bigfiveO stress01 healthphys01 age education {                      //schaut sich alle Variablen des Datensatzes
>  an
  2.    quietly ttest `var', by(includedInSem)
  3.    display "`var';" r(p) ";" r(t) ";"  r(mu_1) ";" r(sd_1) ";" r(mu_2) ";" r(sd_2)
  4.    quietly esize twosample `var', by(includedInSem)
  5.    display ";" r(d) ";" r(lb_d) ";" r(ub_d)
  6. }
sexsat01;.07145047;1.8040918;5.1569721;1.7023477;4.6285714;1.9415839
;.30917018;-.02698409;.64520459
sexsat02;.26497389;1.1151962;5.1498008;1.6739484;4.8421053;1.7324614
;.18362715;-.13921189;.50639511
sexsat03;.28254992;1.0750588;4.2143426;1.7827236;3.8823529;1.5327675
;.18685182;-.1539147;.52754579
sexquan;.51480128;.65155946;3.412749;.9904633;3.3076923;1.0299169
;.10594172;-.21278953;.42463199
sexorgasm01;.93928988;-.07617732;4.6286853;2.0188441;4.65625;2.1191808
;-.01363698;-.3645001;.33723145
sexactBalance;.91399376;.10802359;3.6964143;1.6894772;3.6666667;1.8257419
;.01756433;-.30112438;.33624624
sexfan02;.00951781;-2.5967587;3.9266932;1.6652121;4.6486486;1.7194349
;-.4331518;-.76042634;-.10570981
sexmastB01;.67534394;-.41892054;4.450996;2.0513224;4.5945946;2.1789327
;-.06987796;-.39680692;.25707809
sexpornB01;.22027558;-1.22639;3.114741;1.9038862;3.5;2.0368232
;-.20193621;-.5247169;.12092264
sexnet01;.32768635;-.97915629;3.4414343;2.0972081;3.7837838;2.0566307
;-.16332797;-.49028845;.16369579
sexnet02;.14372991;-1.4629308;3.8390438;1.8730624;4.2972973;2.0394017
;-.24402387;-.57104356;.08309031
couplebond01;.57474732;.56121734;6.2207171;1.2020256;6.0967742;1.6604184
;.10203493;-.25434784;.45837797
couplebond02;.3074743;1.0209419;6.0231076;1.511342;5.7419355;1.6526291
;.18561744;-.17083203;.54199467
coupleint01;.00527858;2.7942961;6.0422311;1.3163073;5.375;1.9134498
;.50022438;.14872949;.85152521
sexcomm01;.78006638;-.27929092;4.8988048;2.145086;5;2.0839523
;-.04721139;-.37851996;.28411548
coupleduration;.46801742;-.72592305;4.4181275;5.0610637;5.0235043;7.0077482
;-.11803303;-.43672727;.20070688
bigfiveO;.99424554;-.00721361;5.6828685;1.1277215;5.6842105;1.1992174
;-.00118779;-.32391336;.32153825
stress01;.40124662;-.83967406;5.0342903;1.820677;5.2820513;1.6050696
;-.13653026;-.45523575;.18222808
healthphys01;.65707608;.44405676;5.25;2.0452026;5.1025641;1.9302968
;.07220498;-.24651731;.39089926
age;.00432816;-2.8582728;27.8376;7.2910461;31.282051;10.625066
;-.46477508;-.78389415;-.145476
education;.31436322;-1.0065007;4.314741;1.050054;4.4871795;1.1669076
;-.16365417;-.48236956;.15512452

. log close
      name:  <unnamed>
       log:  \log\09_Missing_Check.log
  log type:  text
 closed on:  15 May 2022, 18:20:19
------------------------------------------------------------------------------------------------------------------------------------------------------------
