------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \log\B1_ANHANG_WEITEREVARIABLE
> N.log
  log type:  text
 opened on:  15 May 2022, 18:21:46

. 
. //-----------Erstellung ungenutzter IndexVariablen--------------
. 
. 
. //----------- Religion -----------                                                      
. gen religion_yes = .                                            
(1,294 missing values generated)

. replace religion_yes = 1 if religion > 1
(671 real changes made)

. replace religion_yes = 0 if religion == 1
(623 real changes made)

. replace religion_yes = .n if religion == .n
(0 real changes made)

. replace religion_yes = .m if religion == .m
(0 real changes made)

. tab religion_yes, missing

religion_ye |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        623       48.15       48.15
          1 |        671       51.85      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Ablenkende Gedanken -----------
. egen sexnet = rowmean (sexnet01 sexnet03 sexnet04)

. replace sexnet = .m if sexnet01 == .m & sexnet03 == .m & sexnet04 == .m
(0 real changes made)

. replace sexnet = .n if sexnet == .
(0 real changes made)

. tab sexnet, missing

     sexnet |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         77        5.95        5.95
   1.333333 |         69        5.33       11.28
   1.666667 |         69        5.33       16.62
          2 |         94        7.26       23.88
   2.333333 |         99        7.65       31.53
        2.5 |          2        0.15       31.68
   2.666667 |        138       10.66       42.35
          3 |        132       10.20       52.55
   3.333333 |         99        7.65       60.20
        3.5 |          1        0.08       60.28
   3.666667 |         88        6.80       67.08
          4 |        105        8.11       75.19
   4.333333 |         95        7.34       82.53
   4.666667 |         69        5.33       87.87
          5 |         52        4.02       91.89
   5.333333 |         30        2.32       94.20
        5.5 |          1        0.08       94.28
   5.666667 |         30        2.32       96.60
          6 |         12        0.93       97.53
   6.333333 |         11        0.85       98.38
   6.666667 |          6        0.46       98.84
          7 |         15        1.16      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Sexuelles Verlangen -----------                                                   
. egen sexdes = rowmean (sexdes01 sexdes02)                                       

. replace sexdes = .m if sexdes01 == .m & sexdes02 == .m           
(0 real changes made)

. replace sexdes = .n if sexdes == .      
(0 real changes made)

. tab sexdes, missing

     sexdes |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20        1.55        1.55
        1.5 |         32        2.47        4.02
          2 |         39        3.01        7.03
        2.5 |         48        3.71       10.74
          3 |         71        5.49       16.23
        3.5 |         90        6.96       23.18
          4 |        115        8.89       32.07
        4.5 |        103        7.96       40.03
          5 |        101        7.81       47.84
        5.5 |        156       12.06       59.89
          6 |        194       14.99       74.88
        6.5 |        171       13.21       88.10
          7 |        154       11.90      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. ******
. gen sexexp = .                                                                                          
(1,294 missing values generated)

. replace sexexp = age - sexact_time      
(1,279 real changes made)

. replace sexexp = .m if age == .m | sexact_time == .m            
(15 real changes made, 15 to missing)

. replace sexexp = .n if age == .n | sexact_time == .n
(0 real changes made)

. tab sexexp, missing     

     sexexp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          2        0.15        0.15
          1 |         20        1.55        1.70
          2 |         43        3.32        5.02
          3 |         44        3.40        8.42
          4 |         65        5.02       13.45
          5 |         73        5.64       19.09
          6 |         90        6.96       26.04
          7 |         91        7.03       33.08
          8 |        101        7.81       40.88
          9 |         81        6.26       47.14
         10 |         82        6.34       53.48
         11 |         73        5.64       59.12
         12 |         64        4.95       64.06
         13 |         59        4.56       68.62
         14 |         54        4.17       72.80
         15 |         43        3.32       76.12
         16 |         34        2.63       78.75
         17 |         28        2.16       80.91
         18 |         27        2.09       83.00
         19 |         28        2.16       85.16
         20 |         22        1.70       86.86
         21 |         22        1.70       88.56
         22 |         18        1.39       89.95
         23 |         10        0.77       90.73
         24 |         14        1.08       91.81
         25 |         12        0.93       92.74
         26 |          7        0.54       93.28
         27 |          6        0.46       93.74
         28 |         10        0.77       94.51
         29 |         10        0.77       95.29
         30 |          7        0.54       95.83
         31 |          3        0.23       96.06
         32 |          8        0.62       96.68
         33 |          2        0.15       96.83
         34 |          3        0.23       97.06
         35 |          3        0.23       97.30
         36 |          3        0.23       97.53
         37 |          3        0.23       97.76
         38 |          2        0.15       97.91
         39 |          5        0.39       98.30
         40 |          3        0.23       98.53
         41 |          1        0.08       98.61
         42 |          1        0.08       98.69
         45 |          1        0.08       98.76
         50 |          1        0.08       98.84
         .m |         15        1.16      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Wichtigkeit Sex -----------                                                                
. egen seximp = rowmean (seximp01 seximp02)

. replace seximp = .m if seximp01 == .m & seximp02 == .m
(0 real changes made)

. replace seximp = .n if seximp == .      
(0 real changes made)

. tab     seximp, missing

     seximp |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         10        0.77        0.77
        1.5 |         14        1.08        1.85
          2 |         41        3.17        5.02
        2.5 |         34        2.63        7.65
          3 |         72        5.56       13.21
        3.5 |        119        9.20       22.41
          4 |        138       10.66       33.08
        4.5 |        158       12.21       45.29
          5 |        162       12.52       57.81
        5.5 |        166       12.83       70.63
          6 |        161       12.44       83.08
        6.5 |        104        8.04       91.11
          7 |        115        8.89      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Orgasmus -----------                      
. egen sexorgasm = rowmean (sexorgasm01 sexorgasm02)

. replace sexorgasm = .m if sexorgasm01 == .m & sexorgasm02 == .m
(0 real changes made)

. replace sexorgasm = .n if sexorgasm == .        
(0 real changes made)

. tab sexorgasm, missing

  sexorgasm |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         81        6.26        6.26
        1.5 |         45        3.48        9.74
          2 |         44        3.40       13.14
        2.5 |         58        4.48       17.62
          3 |         49        3.79       21.41
        3.5 |         64        4.95       26.35
          4 |         78        6.03       32.38
        4.5 |         91        7.03       39.41
          5 |        102        7.88       47.30
        5.5 |        120        9.27       56.57
          6 |        150       11.59       68.16
        6.5 |        159       12.29       80.45
          7 |        253       19.55      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //--- Paraphilie ---
. egen sexsadoall = rowmean(sexactA16-sexactA21)
(61 missing values generated)

. replace sexsadoall = .m if sexactA16 - sexactA21 == .m
(0 real changes made)

. replace sexsadoall =.n if sexsadoall == .
(61 real changes made, 61 to missing)

. tab sexsadoall, missing

 sexsadoall |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        311       24.03       24.03
   1.166667 |         46        3.55       27.59
        1.2 |          4        0.31       27.90
       1.25 |          5        0.39       28.28
   1.333333 |         56        4.33       32.61
        1.4 |          5        0.39       33.00
        1.5 |         69        5.33       38.33
        1.6 |          2        0.15       38.49
   1.666667 |         74        5.72       44.20
       1.75 |          5        0.39       44.59
        1.8 |          4        0.31       44.90
   1.833333 |         51        3.94       48.84
          2 |         80        6.18       55.02
   2.166667 |         60        4.64       59.66
        2.2 |          4        0.31       59.97
       2.25 |          5        0.39       60.36
   2.333333 |         66        5.10       65.46
        2.4 |          5        0.39       65.84
        2.5 |         47        3.63       69.47
        2.6 |          6        0.46       69.94
   2.666667 |         31        2.40       72.33
       2.75 |          2        0.15       72.49
        2.8 |          5        0.39       72.87
   2.833333 |         28        2.16       75.04
          3 |         40        3.09       78.13
   3.166667 |         23        1.78       79.91
        3.2 |          3        0.23       80.14
       3.25 |          3        0.23       80.37
   3.333333 |          8        0.62       80.99
        3.4 |          5        0.39       81.38
        3.5 |         23        1.78       83.15
        3.6 |          2        0.15       83.31
   3.666667 |         20        1.55       84.85
       3.75 |          2        0.15       85.01
        3.8 |          1        0.08       85.09
   3.833333 |         16        1.24       86.32
          4 |         29        2.24       88.56
   4.166667 |          6        0.46       89.03
       4.25 |          1        0.08       89.10
   4.333333 |          5        0.39       89.49
        4.5 |          2        0.15       89.64
        4.6 |          3        0.23       89.88
   4.666667 |          9        0.70       90.57
       4.75 |          1        0.08       90.65
        4.8 |          1        0.08       90.73
   4.833333 |          6        0.46       91.19
          5 |         21        1.62       92.81
   5.166667 |          1        0.08       92.89
       5.25 |          1        0.08       92.97
   5.333333 |          2        0.15       93.12
        5.5 |          3        0.23       93.35
   5.666667 |          4        0.31       93.66
   5.833333 |          2        0.15       93.82
          6 |         10        0.77       94.59
        6.5 |          2        0.15       94.74
   6.666667 |          2        0.15       94.90
          7 |          5        0.39       95.29
         .n |         61        4.71      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen sexsadosoft = rowmean (sexactA16-sexactA18)                        
(94 missing values generated)

. replace sexsadosoft = .m if sexactA16 - sexactA18 == .m
(0 real changes made)

. replace sexsadosoft =.n if sexsadosoft == .
(94 real changes made, 94 to missing)

. tab sexsadosoft, missing

sexsadosoft |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        290       22.41       22.41
   1.333333 |         48        3.71       26.12
        1.5 |          5        0.39       26.51
   1.666667 |         64        4.95       31.45
          2 |         92        7.11       38.56
   2.333333 |         75        5.80       44.36
        2.5 |          3        0.23       44.59
   2.666667 |         61        4.71       49.30
          3 |         92        7.11       56.41
   3.333333 |         60        4.64       61.05
        3.5 |          9        0.70       61.75
   3.666667 |         68        5.26       67.00
          4 |         65        5.02       72.02
   4.333333 |         38        2.94       74.96
        4.5 |          7        0.54       75.50
   4.666667 |         36        2.78       78.28
          5 |         67        5.18       83.46
   5.333333 |         17        1.31       84.78
        5.5 |          2        0.15       84.93
   5.666667 |         23        1.78       86.71
          6 |         30        2.32       89.03
   6.333333 |          8        0.62       89.64
        6.5 |          4        0.31       89.95
   6.666667 |          9        0.70       90.65
          7 |         27        2.09       92.74
         .n |         94        7.26      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen sexsadohard = rowmean (sexactA19-sexactA21)
(104 missing values generated)

. replace sexsadohard = .m if sexactA19 - sexactA21 == .m
(0 real changes made)

. replace sexsadohard =.n if sexsadohard == .
(104 real changes made, 104 to missing)

. tab sexsadohard, missing

sexsadohard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        872       67.39       67.39
   1.333333 |         80        6.18       73.57
        1.5 |          5        0.39       73.96
   1.666667 |         50        3.86       77.82
          2 |         44        3.40       81.22
   2.333333 |         31        2.40       83.62
        2.5 |          9        0.70       84.31
   2.666667 |         23        1.78       86.09
          3 |         26        2.01       88.10
   3.333333 |          9        0.70       88.79
        3.5 |          1        0.08       88.87
   3.666667 |          8        0.62       89.49
          4 |         10        0.77       90.26
   4.333333 |          3        0.23       90.49
   4.666667 |          1        0.08       90.57
          5 |          9        0.70       91.27
   5.333333 |          2        0.15       91.42
   5.666667 |          1        0.08       91.50
          6 |          3        0.23       91.73
   6.333333 |          1        0.08       91.81
   6.666667 |          1        0.08       91.89
          7 |          1        0.08       91.96
         .n |        104        8.04      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen sexmasoall = rowmean(sexactA24-sexactA29)  
(45 missing values generated)

. replace sexmasoall = .m if sexactA24 - sexactA29 == .m
(0 real changes made)

. replace sexmasoall = .n if sexmasoall == .
(45 real changes made, 45 to missing)

. tab sexmasoall, missing

 sexmasoall |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        251       19.40       19.40
   1.166667 |         35        2.70       22.10
        1.2 |          1        0.08       22.18
       1.25 |          1        0.08       22.26
   1.333333 |         35        2.70       24.96
        1.4 |          1        0.08       25.04
        1.5 |         43        3.32       28.36
        1.6 |          2        0.15       28.52
   1.666667 |         59        4.56       33.08
       1.75 |          1        0.08       33.15
        1.8 |          4        0.31       33.46
   1.833333 |         50        3.86       37.33
          2 |         64        4.95       42.27
   2.166667 |         34        2.63       44.90
        2.2 |          4        0.31       45.21
       2.25 |          4        0.31       45.52
   2.333333 |         39        3.01       48.53
        2.4 |          8        0.62       49.15
        2.5 |         44        3.40       52.55
        2.6 |          7        0.54       53.09
   2.666667 |         39        3.01       56.11
       2.75 |          4        0.31       56.41
        2.8 |          4        0.31       56.72
   2.833333 |         42        3.25       59.97
          3 |         42        3.25       63.21
   3.166667 |         29        2.24       65.46
        3.2 |          4        0.31       65.77
       3.25 |          4        0.31       66.07
   3.333333 |         26        2.01       68.08
        3.4 |          3        0.23       68.32
        3.5 |         32        2.47       70.79
        3.6 |          3        0.23       71.02
   3.666667 |         25        1.93       72.95
       3.75 |          3        0.23       73.18
        3.8 |          3        0.23       73.42
   3.833333 |         16        1.24       74.65
          4 |         42        3.25       77.90
   4.166667 |         21        1.62       79.52
        4.2 |          3        0.23       79.75
       4.25 |          2        0.15       79.91
   4.333333 |         20        1.55       81.45
        4.4 |          2        0.15       81.61
        4.5 |         22        1.70       83.31
        4.6 |          4        0.31       83.62
   4.666667 |         19        1.47       85.09
       4.75 |          1        0.08       85.16
        4.8 |          1        0.08       85.24
   4.833333 |         13        1.00       86.24
          5 |         31        2.40       88.64
   5.166667 |         13        1.00       89.64
        5.2 |          5        0.39       90.03
   5.333333 |         12        0.93       90.96
        5.4 |          2        0.15       91.11
        5.5 |         11        0.85       91.96
        5.6 |          3        0.23       92.19
   5.666667 |          8        0.62       92.81
       5.75 |          1        0.08       92.89
   5.833333 |          3        0.23       93.12
          6 |         25        1.93       95.05
   6.166667 |          3        0.23       95.29
       6.25 |          2        0.15       95.44
   6.333333 |          1        0.08       95.52
        6.4 |          1        0.08       95.60
        6.5 |          1        0.08       95.67
        6.8 |          1        0.08       95.75
   6.833333 |          1        0.08       95.83
          7 |          9        0.70       96.52
         .n |         45        3.48      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen sexmasosoft = rowmean (sexactA24-sexactA26)
(55 missing values generated)

. replace sexmasosoft = .m if sexactA24 - sexactA26 == .m
(0 real changes made)

. replace sexmasosoft = .n if sexmasosoft == .
(55 real changes made, 55 to missing)

. tab sexmasosoft, missing

sexmasosoft |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        249       19.24       19.24
   1.333333 |         36        2.78       22.02
        1.5 |          1        0.08       22.10
   1.666667 |         41        3.17       25.27
          2 |         54        4.17       29.44
   2.333333 |         62        4.79       34.23
        2.5 |          1        0.08       34.31
   2.666667 |         55        4.25       38.56
          3 |         70        5.41       43.97
   3.333333 |         51        3.94       47.91
        3.5 |          8        0.62       48.53
   3.666667 |         42        3.25       51.78
          4 |         78        6.03       57.81
   4.333333 |         45        3.48       61.28
        4.5 |          5        0.39       61.67
   4.666667 |         60        4.64       66.31
          5 |         71        5.49       71.79
   5.333333 |         36        2.78       74.57
        5.5 |          3        0.23       74.81
   5.666667 |         35        2.70       77.51
          6 |         77        5.95       83.46
   6.333333 |         46        3.55       87.02
        6.5 |          2        0.15       87.17
   6.666667 |         23        1.78       88.95
          7 |         88        6.80       95.75
         .n |         55        4.25      100.00
------------+-----------------------------------
      Total |      1,294      100.00

.                 
. egen sexmasohard = rowmean (sexactA27-sexactA29)
(93 missing values generated)

. replace sexmasohard = .m if sexactA27 - sexactA29 == .m
(0 real changes made)

. replace sexmasohard = .n if sexmasohard == .
(93 real changes made, 93 to missing)

. tab sexmasohard, missing

sexmasohard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        767       59.27       59.27
   1.333333 |         49        3.79       63.06
        1.5 |          7        0.54       63.60
   1.666667 |         51        3.94       67.54
          2 |         48        3.71       71.25
   2.333333 |         41        3.17       74.42
        2.5 |          3        0.23       74.65
   2.666667 |         56        4.33       78.98
          3 |         54        4.17       83.15
   3.333333 |         16        1.24       84.39
        3.5 |          6        0.46       84.85
   3.666667 |         19        1.47       86.32
          4 |         22        1.70       88.02
   4.333333 |         13        1.00       89.03
        4.5 |          4        0.31       89.34
   4.666667 |          5        0.39       89.72
          5 |         15        1.16       90.88
   5.333333 |          3        0.23       91.11
        5.5 |          3        0.23       91.34
          6 |          6        0.46       91.81
        6.5 |          2        0.15       91.96
   6.666667 |          1        0.08       92.04
          7 |         10        0.77       92.81
         .n |         93        7.19      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. pwcorr sexactA22 sexactA23, sig                                                                                 

             | sexac~22 sexac~23
-------------+------------------
   sexactA22 |   1.0000 
             |
             |
   sexactA23 |   0.4792   1.0000 
             |   0.0000
             |

. egen sexbiastoakt = rowmean (sexactA22 sexactA23)
(145 missing values generated)

. replace sexbiastoakt = .m if sexactA22 & sexactA23 == .m
(2 real changes made, 2 to missing)

. replace sexbiastoakt = .n if sexbiastoakt == .
(143 real changes made, 143 to missing)

. tab sexbiastoakt, missing

sexbiastoak |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        985       76.12       76.12
        1.5 |         47        3.63       79.75
          2 |         34        2.63       82.38
        2.5 |         19        1.47       83.85
          3 |         17        1.31       85.16
        3.5 |         12        0.93       86.09
          4 |         12        0.93       87.02
        4.5 |          6        0.46       87.48
          5 |         10        0.77       88.25
        5.5 |          1        0.08       88.33
          6 |          1        0.08       88.41
        6.5 |          1        0.08       88.49
          7 |          4        0.31       88.79
         .m |          2        0.15       88.95
         .n |        143       11.05      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. pwcorr sexactA30 sexactA31, sig         

             | sexac~30 sexac~31
-------------+------------------
   sexactA30 |   1.0000 
             |
             |
   sexactA31 |   0.6272   1.0000 
             |   0.0000
             |

. egen sexbiastopass = rowmean (sexactA30 sexactA31)
(113 missing values generated)

. replace sexbiastopass = .m if sexactA30 & sexactA31 == .m
(1 real change made, 1 to missing)

. replace sexbiastopass = .n if sexbiastopass == .
(112 real changes made, 112 to missing)

. tab sexbiastopass, missing

sexbiastopa |
         ss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        823       63.60       63.60
        1.5 |         45        3.48       67.08
          2 |         57        4.40       71.48
        2.5 |         42        3.25       74.73
          3 |         44        3.40       78.13
        3.5 |         43        3.32       81.45
          4 |         29        2.24       83.69
        4.5 |         11        0.85       84.54
          5 |         23        1.78       86.32
        5.5 |         13        1.00       87.33
          6 |         20        1.55       88.87
        6.5 |          4        0.31       89.18
          7 |         27        2.09       91.27
         .m |          1        0.08       91.34
         .n |        112        8.66      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Pornografie -----------                                           
. egen sexpornA = rowmean (sexpornA01 sexpornA02)

. replace sexpornA = .m if sexpornA01 == .m & sexpornA02 ==.m
(0 real changes made)

. replace sexpornA = .n if sexpornA ==.
(0 real changes made)

. tab sexpornA, missing

   sexpornA |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         12        0.93        0.93
        1.5 |         10        0.77        1.70
          2 |         16        1.24        2.94
        2.5 |         23        1.78        4.71
          3 |         34        2.63        7.34
        3.5 |         56        4.33       11.67
          4 |         93        7.19       18.86
        4.5 |        103        7.96       26.82
          5 |        139       10.74       37.56
        5.5 |        158       12.21       49.77
          6 |        209       16.15       65.92
        6.5 |        160       12.36       78.28
          7 |        281       21.72      100.00
------------+-----------------------------------
      Total |      1,294      100.00

.                                                 
. egen sexpornB = rowmean (sexpornB01 sexpornB02)

. replace sexpornB = .m if sexpornB01 == .m & sexpornB02 ==.m
(0 real changes made)

. replace sexpornB = .n if sexpornB ==.
(0 real changes made)

. tab sexpornB, missing

   sexpornB |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        271       20.94       20.94
        1.5 |        182       14.06       35.01
          2 |        131       10.12       45.13
        2.5 |        139       10.74       55.87
          3 |         94        7.26       63.14
        3.5 |         97        7.50       70.63
          4 |        110        8.50       79.13
        4.5 |         74        5.72       84.85
          5 |         44        3.40       88.25
        5.5 |         57        4.40       92.66
          6 |         40        3.09       95.75
        6.5 |         24        1.85       97.60
          7 |         31        2.40      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- sexuelle Handlungen mit dem gleichen Geschlecht -----------
. egen sexbisex = rowmean (sexbisexA01 sexbisexA02)

. replace sexbisex = .m if sexbisexA01 == .m & sexbisexA01 ==.m
(1 real change made, 1 to missing)

. replace sexbisex = .n if sexbisex ==.
(0 real changes made)

. tab sexbisex, missing

   sexbisex |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        274       21.17       21.17
        1.5 |        102        7.88       29.06
          2 |        113        8.73       37.79
        2.5 |         76        5.87       43.66
          3 |         88        6.80       50.46
        3.5 |         71        5.49       55.95
          4 |         71        5.49       61.44
        4.5 |         85        6.57       68.01
          5 |         74        5.72       73.72
        5.5 |         90        6.96       80.68
          6 |         81        6.26       86.94
        6.5 |         77        5.95       92.89
          7 |         91        7.03       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Treuebegriff -----------                                                                          
. egen faithcount = rowtotal (faith01 faith02 faith03 faith04 faith05 faith06 faith07)

. replace faithcount = 0 if faith08 == 1                                          //umcodieren der Fälle, in denen "keine Aktivität ist Untreue", aber trotz
> dem Aktivitäten angekreuzt wurdne
(12 real changes made)

. order faithcount, before(faith01)               

. replace faithcount = .m if faith01 - faith08 == .m
(0 real changes made)

. replace faithcount = .n if faith01 - faith08 == .n
(0 real changes made)

. tab faithcount, missing 

 faithcount |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         95        7.34        7.34
          1 |         15        1.16        8.50
          2 |         15        1.16        9.66
          3 |         30        2.32       11.98
          4 |         60        4.64       16.62
          5 |        172       13.29       29.91
          6 |        717       55.41       85.32
          7 |        190       14.68      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen faithlimitcount = rowtotal (faithlimit01 faithlimit02 faithlimit03 faithlimit04 faithlimit05 faithlimit06 faithlimit07)

. replace faithlimitcount = 7 if faithlimit08 == 1                        //umcodieren der Fälle, in denen "alles verzeihen", aber trotzdem Aktivitäten ange
> kreuzt wurden
(353 real changes made)

. order faithlimitcount, before(faithlimit01)

. replace faithlimitcount = .m if faithlimit01 - faithlimit08 == .m
(0 real changes made)

. replace faithlimitcount = .n if faithlimit01 - faithlimit08 == .n
(0 real changes made)

. tab faithlimitcount, missing

faithlimitc |
       ount |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        0.08        0.08
          1 |         27        2.09        2.16
          2 |         43        3.32        5.49
          3 |        136       10.51       16.00
          4 |        217       16.77       32.77
          5 |        169       13.06       45.83
          6 |        314       24.27       70.09
          7 |        387       29.91      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Beziehung Qualität -----------
. egen couplequal = rowmean (couplequal01 couplequal02)           
(3 missing values generated)

. replace couplequal = .m if couplequal01 == .m & couplequal02 == .m
(2 real changes made, 2 to missing)

. replace couplequal = .n if couplequal == . 
(1 real change made, 1 to missing)

. tab couplequal, missing

 couplequal |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         21        1.62        1.62
        1.5 |         20        1.55        3.17
          2 |         29        2.24        5.41
        2.5 |         44        3.40        8.81
          3 |         58        4.48       13.29
        3.5 |         75        5.80       19.09
          4 |        107        8.27       27.36
        4.5 |        102        7.88       35.24
          5 |        146       11.28       46.52
        5.5 |        154       11.90       58.42
          6 |        190       14.68       73.11
        6.5 |        206       15.92       89.03
          7 |        139       10.74       99.77
         .m |          2        0.15       99.92
         .n |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

.  
. 
. //----------- Beziehung Bindungsstärke -----------
. egen couplebond = rowmean (couplebond01 couplebond02)   
(3 missing values generated)

. replace couplebond = .m if couplebond01 == .m & couplebond02 == .m
(2 real changes made, 2 to missing)

. replace couplebond = .n if couplebond == . 
(1 real change made, 1 to missing)

. tab couplebond, missing

 couplebond |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          7        0.54        0.54
        1.5 |          7        0.54        1.08
          2 |         15        1.16        2.24
        2.5 |         14        1.08        3.32
          3 |         14        1.08        4.40
        3.5 |         26        2.01        6.41
          4 |         36        2.78        9.20
        4.5 |         55        4.25       13.45
          5 |         74        5.72       19.17
        5.5 |         87        6.72       25.89
          6 |        163       12.60       38.49
        6.5 |        183       14.14       52.63
          7 |        610       47.14       99.77
         .m |          2        0.15       99.92
         .n |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

.  
. 
. //----------- Beziehung Intimität -----------                  
. egen coupleint = rowmean (coupleint01 coupleint02)
(2 missing values generated)

. replace coupleint = .m if coupleint01 == .m & coupleint02 == .m
(1 real change made, 1 to missing)

. replace coupleint = .n if coupleint == . 
(1 real change made, 1 to missing)

. tab coupleint, missing

  coupleint |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          9        0.70        0.70
        1.5 |          4        0.31        1.00
          2 |         10        0.77        1.78
        2.5 |         14        1.08        2.86
          3 |         27        2.09        4.95
        3.5 |         27        2.09        7.03
          4 |         53        4.10       11.13
        4.5 |         53        4.10       15.22
          5 |         98        7.57       22.80
        5.5 |        136       10.51       33.31
          6 |        200       15.46       48.76
        6.5 |        220       17.00       65.77
          7 |        441       34.08       99.85
         .m |          1        0.08       99.92
         .n |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Beziehung Vertrauen -----------
. egen coupletrust = rowmean (coupletrust01 coupletrust02)
(3 missing values generated)

. replace coupletrust = .m if coupletrust01 == .m & coupletrust02 == .m
(2 real changes made, 2 to missing)

. replace coupletrust = .n if coupletrust == . 
(1 real change made, 1 to missing)

. tab coupletrust, missing

coupletrust |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14        1.08        1.08
        1.5 |          9        0.70        1.78
          2 |         17        1.31        3.09
        2.5 |         16        1.24        4.33
          3 |         32        2.47        6.80
        3.5 |         40        3.09        9.89
          4 |         60        4.64       14.53
        4.5 |         97        7.50       22.02
          5 |        110        8.50       30.53
        5.5 |        148       11.44       41.96
          6 |        215       16.62       58.58
        6.5 |        240       18.55       77.13
          7 |        293       22.64       99.77
         .m |          2        0.15       99.92
         .n |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Kommunikation -----------
. egen gencomm = rowmean (gencomm01 gencomm02 coupleint03)
(2 missing values generated)

. replace gencomm = .m if gencomm01 == .m & gencomm02 == .m & coupleint03 == .m
(1 real change made, 1 to missing)

. replace gencomm = .n if gencomm == . 
(1 real change made, 1 to missing)

. tab gencomm, missing

    gencomm |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         15        1.16        1.16
   1.333333 |          1        0.08        1.24
   1.666667 |          5        0.39        1.62
          2 |         14        1.08        2.70
   2.333333 |         13        1.00        3.71
   2.666667 |         25        1.93        5.64
          3 |         24        1.85        7.50
   3.333333 |         30        2.32        9.81
   3.666667 |         36        2.78       12.60
          4 |         34        2.63       15.22
   4.333333 |         45        3.48       18.70
   4.666667 |         63        4.87       23.57
          5 |         72        5.56       29.13
   5.333333 |         87        6.72       35.86
   5.666667 |        128        9.89       45.75
          6 |        165       12.75       58.50
   6.333333 |        126        9.74       68.24
   6.666667 |        145       11.21       79.44
          7 |        264       20.40       99.85
         .m |          1        0.08       99.92
         .n |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Kommunikation über Sex -----------
. egen sexcomm = rowmean (sexcomm01 sexcomm02)
(1 missing value generated)

. replace sexcomm = .m if sexcomm01 == .m & sexcomm02 == .m
(1 real change made, 1 to missing)

. replace sexcomm = .n if sexcomm == . 
(0 real changes made)

. tab sexcomm, missing

    sexcomm |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14        1.08        1.08
        1.5 |         15        1.16        2.24
          2 |         23        1.78        4.02
        2.5 |         43        3.32        7.34
          3 |         62        4.79       12.13
        3.5 |         94        7.26       19.40
          4 |        193       14.91       34.31
        4.5 |         97        7.50       41.81
          5 |        104        8.04       49.85
        5.5 |        114        8.81       58.66
          6 |        137       10.59       69.24
        6.5 |        138       10.66       79.91
          7 |        259       20.02       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Big Five -----------
. egen bigfiveE = rowmean (bigfiveE01 bigfiveE02) 

. replace bigfiveE = .m if bigfiveE01 == .m & bigfiveE02 == .m
(0 real changes made)

. replace bigfiveE = .n if bigfiveE == .
(0 real changes made)

. tab bigfiveE, missing

   bigfiveE |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6        0.46        0.46
        1.5 |          1        0.08        0.54
          2 |         10        0.77        1.31
        2.5 |         16        1.24        2.55
          3 |         61        4.71        7.26
        3.5 |        174       13.45       20.71
          4 |        537       41.50       62.21
        4.5 |        301       23.26       85.47
          5 |        121        9.35       94.82
        5.5 |         38        2.94       97.76
          6 |         23        1.78       99.54
        6.5 |          3        0.23       99.77
          7 |          3        0.23      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen bigfiveA = rowmean (bigfiveA01 bigfiveA02 bigfiveA03)      
(1 missing value generated)

. replace bigfiveA = .m if bigfiveA01 == .m & bigfiveA02 == .m & bigfiveA03 == .m
(1 real change made, 1 to missing)

. replace bigfiveA = .n if bigfiveA == .
(0 real changes made)

. tab bigfiveA, missing

   bigfiveA |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        0.15        0.15
   1.666667 |          1        0.08        0.23
          2 |          1        0.08        0.31
   2.333333 |          2        0.15        0.46
   2.666667 |         12        0.93        1.39
          3 |         24        1.85        3.25
   3.333333 |         42        3.25        6.49
   3.666667 |        102        7.88       14.37
          4 |        150       11.59       25.97
   4.333333 |        150       11.59       37.56
   4.666667 |        223       17.23       54.79
          5 |        204       15.77       70.56
   5.333333 |        167       12.91       83.46
   5.666667 |        104        8.04       91.50
          6 |         67        5.18       96.68
   6.333333 |         24        1.85       98.53
   6.666667 |         14        1.08       99.61
          7 |          4        0.31       99.92
         .m |          1        0.08      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen bigfiveC = rowmean (bigfiveC01 bigfiveC02)                         

. replace bigfiveC = .m if bigfiveC01 == .m & bigfiveC02 == .m
(0 real changes made)

. replace bigfiveC = .n if bigfiveC == .
(0 real changes made)

. tab bigfiveC, missing

   bigfiveC |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        0.15        0.15
        1.5 |          2        0.15        0.31
          2 |          2        0.15        0.46
        2.5 |          5        0.39        0.85
          3 |         23        1.78        2.63
        3.5 |         94        7.26        9.89
          4 |        222       17.16       27.05
        4.5 |        263       20.32       47.37
          5 |        258       19.94       67.31
        5.5 |        195       15.07       82.38
          6 |        149       11.51       93.89
        6.5 |         48        3.71       97.60
          7 |         31        2.40      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. egen bigfiveN = rowmean (bigfiveN01 bigfiveN02)                         

. replace bigfiveN = .m if bigfiveN01 == .m & bigfiveN02 == .m
(0 real changes made)

. replace bigfiveN = .n if bigfiveN == .
(0 real changes made)

. tab bigfiveN, missing

   bigfiveN |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          7        0.54        0.54
        1.5 |          9        0.70        1.24
          2 |         48        3.71        4.95
        2.5 |         70        5.41       10.36
          3 |        154       11.90       22.26
        3.5 |        264       20.40       42.66
          4 |        418       32.30       74.96
        4.5 |        198       15.30       90.26
          5 |         72        5.56       95.83
        5.5 |         34        2.63       98.45
          6 |         13        1.00       99.46
        6.5 |          3        0.23       99.69
          7 |          4        0.31      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Selbstsicherheit -----------
. egen sexselfconfA = rowmean (sexselfconf01 sexselfconf02)

. replace sexselfconfA = .m if sexselfconf01 == .m & sexselfconf02 == .m
(0 real changes made)

. replace sexselfconfA = .n if sexselfconfA == .
(0 real changes made)

. tab sexselfconfA, missing

sexselfconf |
          A |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6        0.46        0.46
        1.5 |          6        0.46        0.93
          2 |         28        2.16        3.09
        2.5 |         37        2.86        5.95
          3 |         58        4.48       10.43
        3.5 |         84        6.49       16.92
          4 |        138       10.66       27.59
        4.5 |        151       11.67       39.26
          5 |        133       10.28       49.54
        5.5 |        165       12.75       62.29
          6 |        181       13.99       76.28
        6.5 |        169       13.06       89.34
          7 |        138       10.66      100.00
------------+-----------------------------------
      Total |      1,294      100.00

.         
. egen sexselfconfB = rowmean (sexselfconf03 sexselfconf04)

. replace sexselfconfB = .m if sexselfconf03 == .m & sexselfconf04 == .m
(0 real changes made)

. replace sexselfconfB = .n if sexselfconfB == .  
(0 real changes made)

. tab sexselfconfB, missing

sexselfconf |
          B |      Freq.     Percent        Cum.
------------+-----------------------------------
        1.5 |          3        0.23        0.23
          2 |         10        0.77        1.00
        2.5 |         19        1.47        2.47
          3 |         38        2.94        5.41
        3.5 |         61        4.71       10.12
          4 |        119        9.20       19.32
        4.5 |        156       12.06       31.38
          5 |        173       13.37       44.74
        5.5 |        207       16.00       60.74
          6 |        234       18.08       78.83
        6.5 |        143       11.05       89.88
          7 |        131       10.12      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Perfektionismus - selbst orientiert -----------
. egen perfself = rowmean (perfself01 perfself02) 

. replace perfself = .m if perfself01 == .m & perfself02 == .m
(0 real changes made)

. replace perfself = .n if perfself == .  
(0 real changes made)

. tab perfself, missing

   perfself |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        122        9.43        9.43
        1.5 |         53        4.10       13.52
          2 |         95        7.34       20.87
        2.5 |        104        8.04       28.90
          3 |         95        7.34       36.24
        3.5 |         93        7.19       43.43
          4 |        167       12.91       56.34
        4.5 |        133       10.28       66.62
          5 |        125        9.66       76.28
        5.5 |        113        8.73       85.01
          6 |         92        7.11       92.12
        6.5 |         48        3.71       95.83
          7 |         54        4.17      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Perfektionismus - Partner orientiert -----------
. egen perfpartner = rowmean (perfpartner01 perfpartner02)

. replace perfpartner = .m if perfpartner01 == .m & perfpartner02 == .m
(0 real changes made)

. replace perfpartner = .n if perfpartner == .    
(0 real changes made)

. tab perfpartner, missing

perfpartner |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         13        1.00        1.00
        1.5 |         11        0.85        1.85
          2 |         29        2.24        4.10
        2.5 |         46        3.55        7.65
          3 |         85        6.57       14.22
        3.5 |        109        8.42       22.64
          4 |        150       11.59       34.23
        4.5 |        170       13.14       47.37
          5 |        224       17.31       64.68
        5.5 |        169       13.06       77.74
          6 |        118        9.12       86.86
        6.5 |         74        5.72       92.58
          7 |         96        7.42      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Gesundheit psychisch -----------
. egen healthment = rowmean (healthment01 healthment02)

. replace healthment = .m if healthment01 == .m & healthment02 == .m
(0 real changes made)

. replace healthment = .n if healthment == .
(0 real changes made)

. tab healthment, missing

 healthment |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         95        7.34        7.34
        1.5 |         67        5.18       12.52
          2 |         67        5.18       17.70
        2.5 |         85        6.57       24.27
          3 |         82        6.34       30.60
        3.5 |         84        6.49       37.09
          4 |        102        7.88       44.98
        4.5 |        106        8.19       53.17
          5 |        112        8.66       61.82
        5.5 |        107        8.27       70.09
          6 |         92        7.11       77.20
        6.5 |        111        8.58       85.78
          7 |        184       14.22      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Verhütung -----------                                                    
. gen contracept_no = 0

. replace contracept_no = 1 if contracept01 == 1
(176 real changes made)

. 
. gen contracept_horm = 0

. replace contracept_horm = 1 if contracept03 == 1 | contracept04 == 1 | contracept05 == 1 | contracept06 == 1
(715 real changes made)

. tab contracept_horm, missing

contracept_ |
       horm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        579       44.74       44.74
          1 |        715       55.26      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. gen contracept_other = 0                                                                                                                                  
>                                               //<------- vielleicht müssen wir hier auch noch "Kondom" rausnehmen, da die meisten das nur zur Übergangsver
> hütung einsetzen?

. replace contracept_other = 1 if contracept02 == 1 | contracept07 == 1 | contracept08 == 1 | contracept09 == 1
(599 real changes made)

. replace contracept_other = 0 if contracept03 == 1 | contracept04 == 1 | contracept05 == 1 | contracept06 == 1   //entfernt "hormonell verhütende Menschen"
>  aus other, die nur zusätzlich ander als hormonell verhüten
(168 real changes made)

. tab contracept_other, missing

contracept_ |
      other |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        863       66.69       66.69
          1 |        431       33.31      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. replace contracept_no = 0 if contracept_horm == 1 | contracept_other == 1                                                                               //
> entfernt die Fälle aus "keine Verhütung", die auch eine Verhütung angegeben haben
(28 real changes made)

. tab contracept_no, missing

contracept_ |
         no |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,146       88.56       88.56
          1 |        148       11.44      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Körperbild -----------
. egen bodyimage = rowmean (bodyimage01 bodyimage02)

. replace bodyimage = .m if bodyimage01 == .m & bodyimage02 == .m
(0 real changes made)

. replace bodyimage = .n if bodyimage == .
(0 real changes made)

. tab bodyimage, missing

  bodyimage |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         88        6.80        6.80
        1.5 |         45        3.48       10.28
          2 |         93        7.19       17.47
        2.5 |         93        7.19       24.65
          3 |        111        8.58       33.23
        3.5 |        110        8.50       41.73
          4 |        160       12.36       54.10
        4.5 |         97        7.50       61.59
          5 |        169       13.06       74.65
        5.5 |        107        8.27       82.92
          6 |        128        9.89       92.81
        6.5 |         56        4.33       97.14
          7 |         37        2.86      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Partner Attraktivität -----------
. egen partnerattr = rowmean (partnerattr01 partnerattr02)
(3 missing values generated)

. replace partnerattr = .m if partnerattr01 == .m & partnerattr02 == .m
(1 real change made, 1 to missing)

. replace partnerattr = .n if partnerattr == .
(2 real changes made, 2 to missing)

. tab partnerattr, missing

partnerattr |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        0.31        0.31
        1.5 |         13        1.00        1.31
          2 |         14        1.08        2.40
        2.5 |         28        2.16        4.56
          3 |         36        2.78        7.34
        3.5 |         74        5.72       13.06
          4 |        113        8.73       21.79
        4.5 |         93        7.19       28.98
          5 |        109        8.42       37.40
        5.5 |        127        9.81       47.22
          6 |        145       11.21       58.42
        6.5 |        198       15.30       73.72
          7 |        337       26.04       99.77
         .m |          1        0.08       99.85
         .n |          2        0.15      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- Qualität Sex -----------                                 
. egen sexqual = rowmean (sexqual01 sexqual02)

. replace sexqual = .m if sexqual01 == .m & sexqual02 == .m
(0 real changes made)

. replace sexqual = .n if sexqual == .
(0 real changes made)

. tab sexqual, missing

    sexqual |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        0.39        0.39
        1.5 |          2        0.15        0.54
          2 |         13        1.00        1.55
        2.5 |         12        0.93        2.47
          3 |         29        2.24        4.71
        3.5 |         31        2.40        7.11
          4 |         71        5.49       12.60
        4.5 |        115        8.89       21.48
          5 |        145       11.21       32.69
        5.5 |        196       15.15       47.84
          6 |        244       18.86       66.69
        6.5 |        222       17.16       83.85
          7 |        209       16.15      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. 
. //----------- sexuelle Zufriedenheit -----------
. egen sexsat = rowmean(sexsat01 sexsat02 sexsat04 sexsat03)

. replace sexsat = .m if sexsat01 - sexsat03 == .m
(0 real changes made)

. replace sexsat = .n if sexsat == .
(0 real changes made)

. tab sexsat, missing

     sexsat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         16        1.24        1.24
       1.25 |          5        0.39        1.62
        1.5 |         18        1.39        3.01
       1.75 |         18        1.39        4.40
          2 |         23        1.78        6.18
       2.25 |         16        1.24        7.42
        2.5 |         33        2.55        9.97
       2.75 |         33        2.55       12.52
          3 |         32        2.47       14.99
       3.25 |         44        3.40       18.39
        3.5 |         45        3.48       21.87
       3.75 |         36        2.78       24.65
          4 |         51        3.94       28.59
       4.25 |         45        3.48       32.07
   4.333333 |          3        0.23       32.30
        4.5 |         61        4.71       37.02
   4.666667 |          1        0.08       37.09
       4.75 |         62        4.79       41.89
          5 |         87        6.72       48.61
       5.25 |         92        7.11       55.72
   5.333333 |          1        0.08       55.80
        5.5 |         77        5.95       61.75
       5.75 |         80        6.18       67.93
          6 |        101        7.81       75.73
       6.25 |         79        6.11       81.84
        6.5 |         83        6.41       88.25
       6.75 |         60        4.64       92.89
          7 |         92        7.11      100.00
------------+-----------------------------------
      Total |      1,294      100.00

. 
. log close
      name:  <unnamed>
       log:  \log\B1_ANHANG_WEITEREVARIABLE
> N.log
  log type:  text
 closed on:  15 May 2022, 18:21:46
------------------------------------------------------------------------------------------------------------------------------------------------------------
